[{
        "url": "http://hcps.harriscountytx.gov/",
        "text": "TRIAD Prevention Program. : Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Welcome to HCPS. We are at the heart of families with a vision to better the lives of children and adults in Harris County. With more than a dozen programs offered, let us be a part of helping you and your family grow.. For Children. The HCPS Children's Services Division provides services to abused and neglected children in state care.. For Youth. The HCPS Youth Services Division offers free, voluntary programs to youth experiencing crises and their families.. For Seniors and Disabled Adults. The HCPS Adult Services Division provides services to adults who need assistance to manage their affairs.. Harris County Protective Services. Tweets by hcps1966. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/",
        "text": "TRIAD Prevention Program. : Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Welcome to HCPS. We are at the heart of families with a vision to better the lives of children and adults in Harris County. With more than a dozen programs offered, let us be a part of helping you and your family grow.. For Children. The HCPS Children's Services Division provides services to abused and neglected children in state care.. For Youth. The HCPS Youth Services Division offers free, voluntary programs to youth experiencing crises and their families.. For Seniors and Disabled Adults. The HCPS Adult Services Division provides services to adults who need assistance to manage their affairs.. Harris County Protective Services. Tweets by hcps1966. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/About-Us/Board-Members",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. About Us. Board Members. Board Members. Jo Ellen Sweeney, President. Sherea McKenzie, Vice President. Patrice B. McKinney, Treasurer. Lidya Kushner, Secretary. Sheila Aron. Marilyn DeMontrond. Frances Castenada Dyess. Charlene Hunter James. Darryl King. Philip J. Kunetka. Jerry LeVias. Susan Branda Martin. Sean Kelly McPherson. Pat Rosenberg. Janet Stansbury, M.Ed.. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Get-Involved/HCCPS-Fund",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Get Involved. HCCPS Fund. HCCPS Fund. The Harris County Children’s Protective Services Fund, a 501(c)(3) organization, was founded to enhance HCPS programming with funding not available through other sources. Monetary donations to fight abuse of children, youth and adults in Harris County may be made to the HCCPS Fund.. Visit. hccpsfund.org.for more information.. Ensuring the sky is the limit for HCPS Families. hccpsfund.org. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Adults",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Adult Services. Adult Services. The HCPS Adult Services Division provides services to adults living in Harris County who need assistance to manage their affairs. This determination is made either through the Harris County Probate Court System or through a voluntary program. The three programs included are:. Guardianship Program. At times, adults who no longer have ability to care for themselves need a guardian to guide them and protect them.. Representative Payee Program. The Representative Payee Program assists low-income Harris County adults who are in need of financial management so that they can live independently.. Senior Justice Assessment Center. The Senior Justice Assessment Center is a central site where multi-disciplinary teams perform forensic interviews, assessments and interventions for senior victims of crime.. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/About-Us/Administrative-Staff",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. About Us. Administrative Staff. Administrative Staff. Joel Levine, M.A., LCSW. Executive Director. Anna Bell, B.A., LMSW-AP, LCDC. Organizational Development &. Strategic Initiatives Director. Marsha Mitchell, MBA, SPHR, SHRM-SCP. Human Resources Director. Beverly Pettway, M.B.A, CPA. Financial and Business Services Administrator. Claudia Gonzalez, LMSW, TxCG. Adult Services Division Administrator. Ginger Harper, B.S., LMSW-AP. Youth Services Division Administrator. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/About-Us/Who-We-Are",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. About Us. Who We Are. Who We Are. Vision Statement. To better the lives of children and adults in Harris County.. Mission Statement. To support, enhance and advocate for the safety and well-being of children and adults in Harris County.. Core Values. HELP · EXCELLENCE · ACCOUNTABILITY · RESPECT · TEAMWORK. We. HELP.restore and transform lives.. We strive for. EXCELLENCE.in carrying out our mission.. We hold ourselves. ACCOUNTABLE.to our clients, our community and each other.. We show. RESPECT.for the dignity and worth of every person.. We promote. TEAMWORK.by building trusting relationships.. History. Harris County Protective Services (HCPS) was founded in 1966 as Harris County Child Welfare to provide support services for the children taken under the wing of the Texas Department of Family and Protective Services. Fifty years later, HCPS still provides this support. But the now-county department has expanded services for early prevention, intervention and adult services.. Children’s Services Division. assesses the whole family when the state department investigates abuse and neglect allegations; provides medical, dental and mental health care while children are in the care of the state; provides basic needs for these children and programming for young adults who are aging out of the foster care system with an emphasis on education and employment. Youth Services Division. has free school- and community-based programs to ensure youth and their families dealing with tough familial, mental health and life crises remain in their own homes and are successful in school, in the family and the community.. Adult Services Division. provides services to adults living in Harris County who need assistance to manage their affairs. This determination is made either through the Harris County Probate Court System or through a voluntary program.. When you think of healthy and happy families, think of Harris County Protective Services. Because we are. At the Heart of Families. , and provide services to ensure we remain there. We take pride in our.Council on Accreditation (COA).certification, which reviews and certifies that our programs meet stringent best practice standards.. Children's Services Division. Youth Services Division. Adult Services Division. Get Involved. We can't do it alone. Join us in our vision to better the lives of children and adults in Harris County.. Donate Today. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/About-Us/Board-Materials",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. About Us. Board Materials. Board Materials. The 15-member.HCPS Board of Directors.sets policies, establishes priority for goals and objectives, and delegates the responsibility to take action necessary to meet stated objectives. Harris County Commissioners appoint board members, who meet the fourth Thursday of the month.. Board Packets. December 2019. October 2019. September 2019. August 2019. June 2019. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Childrens-Services",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Children's Services. Children's Services. Each year, more than 29,000 children are involved with Child Protective Services (CPS) in Harris County. The HCPS Children’s Services Division provides services to support these abused and neglected children and youth who are in the care and custody of the. Texas Department of Family and Protective Services. . Many of these services are offered through contracts with DFPS.. Children's Crisis Care Center. The Children's Crisis Care Center (4Cs) help create long-lasting plans for children entering the care of the Texas Department of Family and Protective Services.. BEAR. BEAR...BE A Resource for CPS Kids offers hope and help for abused and neglected children and the CPS caseworkers who protect them.. HCPS Clinic. The Integrated HCPS Clinic was established to make accessing healthcare easier for those caring for children and youth in the care of the Texas Department of Family and Protective Services.. The HAY Center. The HAY Center is one of two nonprofits operating under the umbrella of HCPS. The HAY (Houston Alumni & Youth) Center helps older foster youth transition to independence.. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/About-Us/Accreditation-Partnerships",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. About Us. Accreditation & Partnerships. COA Accreditation. We take pride in being accredited by the. Council on Accreditation (COA).by successfully meeting best practice standards across the nation that ensure our services are accessible, culturally responsive, evidence based, and outcomes-oriented.. In addition, they confirm that the services are provided by a skilled and supported workforce and that all individuals are treated with dignity and respect. HCPS has been COA Accredited since 1978.. Partners. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Youth-Services",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Youth Services. Youth Services. The HCPS Youth Services Division offers free, voluntary programs to youth experiencing crises and their families. Many of these services are voluntary and equip families with the tools for better communication and problem solving. The goal is to strengthen youth and their families before circumstances become dire enough to require the attention of county and state officials.. Community Youth Services. Community Youth Services (CYS) helps youth and their families with school and family challenges.. TRIAD Prevention. TRIAD is a consortium of three agencies providing programs to divert at-risk youth from involvement with official systems.. Kinder Emergency Shelter. The Shelter provides a nurturing home-like environment for youth who are experiencing family conflict.. Safety Net Program. Safety Net services create alternatives to running away for at-risk youth.. We accomplish this through services that include behavioral and psychological assessments, counseling for youth and families, crisis intervention, referral services and more. These services include:. Behavioral and psychosocial assessments. Counseling for youth and families. Crisis Intervention. Emergency Shelter services for youth ages 12 to 17. Prevention and early intervention services. Community Information and Referral services. Service Coordination. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Youth-Services/TRIAD-Prevention-Program",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Youth Services. TRIAD Prevention Program. TRIAD. TRIAD Prevention Program. TRIAD is a consortium of three county agencies (HCPS,. Harris County Juvenile Probation. , and the. Harris Center for Mental Health and IDD. ) working together. TRIAD provides county-wide services to intervene with youth and families before involvement with the. DFPS. , mental health and/or juvenile justice systems. There are nine programs that operate under the TRIAD program.. Intake Diversion. JP Court Wrap. JP Court Liaison. Community Youth Development (Pasadena). Youth & Family Resource Services (CRCG). Community Youth Development (Gulfton). TRIAD Mental Health. Parent/Teen Survival. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/About-Us/Careers",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. About Us. Careers. Career Opportunities. Job Opportunities. Job Opportunities. HCPS Internship Opportunities. Student Interest Form. L.E.E. (Leadership Experience & Employment Program).summer internships. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Get-Involved/Ways-to-Help",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Get Involved. Ways to Help. Ways to Help. HCPS helps the community through more than a dozen programs, and each requires community support to achieve the HCPS vision to better the lives of children and adults in Harris County. You can be the difference in the lives of children, teenagers and adults.. Mentor a current/former foster youth. Mentor a Pasadena youth. Mentor a Gulfton youth. Volunteer to help a child. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Get-Involved/Ways-to-Give1",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Get Involved. Ways to Give. Ways to Give. Donate Today. In-Kind Gifts. HCPS depends on community resources to ensure our clients have the basic necessities of life, such as soap, toiletries, back-to-school items and more.. Guardianship Kloset. The Guardianship Kloset provides essentials to clients in the HCPS Guardianship Program that their modest budgets cannot afford.. BEAR Room. There are eight BEAR Rooms throughout the Harris County area, where CPS caseworkers obtain items for children in DFPS care.. The HAY Center. The HAY Center helps current and former foster youth transition to independence. Help us provide them with basic needs.. Community Youth Services. The youth we serve in school sometimes need basic necessities. We cannot do it alone and need your help.. Kinder Emergency Shelter. The Kinder Emergency Shelter is a short-term home-away-from-home for youth in crises. With your help, we can ensure it feels like a home.. Monetary Gifts. We can't do it alone. Join us in our mission to protect children and adults in Harris County.. Donate Today. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2f",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Contact-Us/Baby-Moses-Hotline",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Contact Us. Baby Moses Hotline. Baby Moses Hotline. The HCPS Intake Diversion staff provide around-the-clock information and referral services by phone for the Baby Moses Law. The Baby Moses Law allows parents to leave a baby (up to 60 days old) with an employee on duty at any hospital, emergency medical services provider or child welfare agency in Texas with no criminal consequences. The law, known as \"Safe Haven\" laws across the nation, was implemented to reduce the number of newborn babies abandoned in dangerous environments.. Access the Baby Moses Hotline at. 1.877.904.SAVE. .. Download PDF (English). Download PDF (Spanish). 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Contact-Us/Frequently-Asked-Questions",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Contact Us. Frequently Asked Questions. Frequently Asked Questions. How can I help my troubled teenager?. Get help for At-Risk Youth through the following programs:. Community Youth Services Program. TRIAD Prevention Program. The HAY Center. (for current and former foster youth only). Where do I get help for my runaway teen?. For prevention and intervention services, please contact:. Community Youth Services Program. Safety Net Program. TRIAD Prevention Program. My teen and I are having trouble getting along as a family. How can you help?. Parenting with Love and Limits. Parent/Teen Survival. My child is being bullied. Where can I get help?. Community Youth Services. TRIAD Intake. My family is in need of assistance with basic necessities. Where can I get help?. Visit our. Publications page.for the CYS Resource Guide and Natural Support Resource Guide, which list community organizations, churches and groups that provide assistance to families.. If you are a current or former foster youth, contact. The HAY Center. .. Will your Guardianship Program take care of my relative?. Harris County Probate Courts.determine who needs a public guardian. Without the determination, HCPS Guardianship Program cannot serve as a guardian.. I would like to be a guardian of my relative. What do I need to know?. There are many resources available for anyone serving as a guardian.. Visit our Pinterest page.for more information.. I know an adult who can care for him/herself but needs assistance managing their finances.. In an effort to reduce exploitation, the. Representative Payee Program.  provides voluntary financial management assistance to adults.. I know someone who is aging in their own home. How can I help them?. More and more Americans are choosing to “age in place.” For more information,. visit our Pinterest page. .. Where can I take my newborn baby if I cannot care for him/her?. The Baby Moses Law allows parents to leave a baby (up to 60 days old) with an employee on duty at any hospital, emergency medical services provider or child welfare agency in Texas with no criminal consequences.. For more information, call the. Baby Moses Hotline. ,.which our HCPS. Intake Diversion.staff manages.. How can I report abuse/neglect of a child, senior or disabled person?. To report abuse or find information about an existing case, please visit our. close partner DFPS. .. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Press-Releases",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Press Releases. Press Releases. Featured. Healing Through the Arts: Children's Art Exhibit. Published. on November 30, 2017. by. HCPS Content Manager.in. Featured Press Releases. ,. In the News. ,. Press Releases. During and after Hurricane Harvey, we saw great acts of heroism in the Houston area. The Houston community came together to help each other, to help neighbors and complete strangers. However, a natural disaster and can also have a significant impact on the behavioral and mental well-being of a community. Research shows that most people will recover, but others may suffer from the trauma of such a disaster and experience depression, anxiety and other mental health disorders.... In the News. Press Releases. Most Recent. BEARing Gifts Needs Your Help to Bring Holiday Cheer.... December 1,2017. 0. 3287. Restoring Holiday Spirits with Portable AM/FM Radios. December 1,2017. 0. 2871. Healing Through the Arts: Children's Art Exhibit. November 30,2017. 0. 2890. Foster Care Center of Excellence Awarded to HCPS Clinic. June 13,2017. 0. 4052. Jobs Help Foster Youth Overcome Legal Challenges. June 9,2017. 0. 2795. Read More ». .rg_widgetBox .news .lawidget .article-thumbnail {display:none;}. BEARing Gifts Needs Your Help to Bring Holiday Cheer.... Published. on December 1, 2017. by. Luis Morales.in. In the News. ,. Press Releases. BEARing Gifts is BEAR’s annual holiday gift giving program that provides holiday gifts to children under the care of Child Protective Services (CPS) who otherwise would have no holiday at all. Caseworkers submit the holiday wishes of children on their caseloads. With the help of generous supporters, those wishes become a reality. Last year BEAR was able secure gifts for nearly 12,000 CPS children in Harris County.  This year BEAR has already received wishes from about 12,000 children and over 7,000 children still need to be sponsored. Sadly, more children will enter the CPS system before the holiday season is over so we expect the number to rise.   We are inviting the community to assist us in ensuring that thousands of abused and neglected children have a joyous and memorable holiday.   On Saturday, December 2nd, BEAR volunteers will sort through an assortment of donated gifts and toys to match the wishes of abused and neglected children. For more information on sponsoring a child, volunteer opportunities or other ways to help contact BEAR at or go to www.bearesourcehouston.orgDOWNLOAD THE PRESS RELEASE. Restoring Holiday Spirits with Portable AM/FM Radios. Published. on December 1, 2017. by. Luis Morales.in. In the News. ,. Press Releases. While everyone was waiting in line for the best Black Friday deal or glued to their computer to take advantage of Cyber Monday deals, the Harris County Guardianship Program has been asking the community to assist in collecting the ultimate fossil – an AM/FM radio!  The Guardianship Program serves as the legal guardian for more than 1,200 indigent seniors and adults with mental, physical and developmental challenges who may often be alone and forgotten during the holidays.  Many of these clients are seniors who raised families or veterans who served our country, but now find themselves alone.Studies show that music has many healing benefits. It has the power to completely change someone’s mood, assist with memory recall, and even help restore and improve overall health.  This holiday season the Harris County program aims to supply every senior and vulnerable adult under their care with a new portable radio to help restore their gleeful holiday spirit.  So far we have received 700 radios from generous donors but we are still in need of 500 more donations. Portable radios and monetary .... Healing Through the Arts: Children's Art Exhibit. Published. on November 30, 2017. by. HCPS Content Manager.in. Featured Press Releases. ,. In the News. ,. Press Releases. During and after Hurricane Harvey, we saw great acts of heroism in the Houston area. The Houston community came together to help each other, to help neighbors and complete strangers. However, a natural disaster and can also have a significant impact on the behavioral and mental well-being of a community.  Research shows that most people will recover, but others may suffer from the trauma of such a disaster and experience depression, anxiety and other mental health disorders.In addition to Harvey, the children involved with Harris County Protective Services (HCPS) have experienced multiple traumatic events in their lives, such as bullying, teen suicide, homelessness, and abuse and neglect, to name a few.  Art therapy has been found to have the potential to help adults and children heal from very traumatic circumstances. It’s even more effective in children because their mind and body continue developing throughout their adolescence. Since words aren’t necessary in art therapy, children can express through art what they aren’t able to express verbally.    Art, paintings, and poetry created by children involved with HCPS will be on the .... Foster Care Center of Excellence Awarded to HCPS Clinic. Published. on June 13, 2017. by. Lee Baughman.in. In the News. ,. Press Releases. HOUSTON -- In Harris County, there are over 4,000 children in the custody of the Texas Department of Family and Protective Services.  The Harris County Protective Services (HCPS) Clinic, a unique clinic dedicated to treating the trauma of children in foster care, is now the first Foster Care Center of Excellence in Harris County.Superior Health will announce the Center of Excellence designation Tuesday at a special ceremony celebrating the collaboration between HCPS, UTHealth, the Texas Department of Family and Protective Services (DFPS) and Superior Health. To qualify as a Foster Care Center of Excellence, a clinic must meet 47 criteria and the highest standards of care for foster children and their caretakers.  The HCPS Clinic is now the only clinic in Harris County to receive the designation and the second in Texas.“We are proud to receive this designation,” said Joel Levine, HCPS executive director. “It is a reflection of the hard work our staff has done to ensure foster children with visible and invisible wounds can heal in a safe, inviting atmosphere.”As the oldest and first program of HCPS, the .... Jobs Help Foster Youth Overcome Legal Challenges. Published. on June 9, 2017. by.in. Press Releases. Every year approximately 200 foster youth in Harris Countyage out or emancipate from the foster care system. Children who age out of careare more susceptible to negative outcomes due to a lack of traditional familysupport and opportunities. The challenges they face such as homelessness,unemployment, poverty and even incarceration can hinder a successful transitionto adulthood. TheHAY Center,a program of HarrisCounty Protective Services, is pleased to announce that it has received a $10,000grant from the Texas Bar Foundation in support of Overcoming Legal Challenges Faced by Current and Former Foster CareYouth to Gain Stability and Self-Sufficiency.  The support from the Texas Bar Foundationwill allow the HAY Center to offer foster youth involved with the courts andjudicial system with paid internship opportunities to earn money to pay courtrelated costs, fees, and fines; thus avoiding additional complications.  This also allows youth to gain valuableworkforce experience, and help build skills needed for employment. Mary Green,Director of the HAY Center states:  “Weare so grateful to the Texas Bar Foundation for their support of the HAY Centerand our mission.   Giving youth theopportunity to pay off their court .... 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/News1",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. News. News. Featured. HCPS Executive DirectorDelivers Keynote Address. Published. on August 23, 2019. by. HCPS Content Manager.in. Featured News. ,. In the News. ,. Word from the ED. On August 16, 2019 Joel Levine, HCPS Executive Director, delivered a Keynote address to staff at the bi-annual Employee Appreciation Ceremony.  Within his remarks, Mr. Levine addressed agency accomplishments, challenges and his vision for the future.. EMPLOYEE APPRECIATION CEREMONY. August 16, 2019. KEYNOTE ADDRESS. Joel Levine. There were two young service man that enlisted in the Australian Navy. After many months at sea, they finally received a pass to spend the night in town when they docked at port. Naturally, the young men had too much to drink and were stumbling around trying to find their way back to the ship, when they bumped into a man in a decorated uniform, obviously a very .... .MNormal{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: normal;}.MNormalBold{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;}.MNormalRed{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: bold;color: #ff0000;}.MHead{font-family: Tahoma, Arial, Helvetica;font-size: 20px;font-weight: normal;color: #333333;}.MSubHead{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;color: #003366;}.MNormalTextBox{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: normal;}. In the News. Media coverage of HCPS programs and services. Most Recent. HCPS Executive DirectorDelivers Keynote Address. August 23,2019. 0. 262. HCPS Guardianship Program Fights the Summer Heat. July 9,2018. 0. 1975. BEARing Gifts Needs Your Help to Bring Holiday Cheer.... December 1,2017. 0. 3287. Restoring Holiday Spirits with Portable AM/FM Radios. December 1,2017. 0. 2871. Healing Through the Arts: Children's Art Exhibit. November 30,2017. 0. 2890. Read More ». Media Contact. Press Releases. For media requests, contact:. Estella Olguin. Senior Communications Manager. 713.410.9773. Luis Morales. Communications Specialist. 713.394-4067. Recent News. HCPS offers new parenting class. Published. on October 19, 2017. by.in. Newsletter. Free one-day parenting classes are now available through the HCPS JP Court Liaisons program. The second round of “Teen Awareness” classes begins this fall, in addition to parenting classes offered through the TRIAD Prevention Program. The classes are open to the general public, as well as those required by court. “We wanted to offer an additional service for those individuals who are due back to court, and there are no PLL (Parenting with Love and Limits) and PTS (Parent/Teen Survival) classes available or scheduled,” said Shenetha Toliver, JP Court program specialist. Teenagers and their parents will attend two separate group sessions during the class. Parents will discuss tips regarding their child’s grades and attendance and building relationships with school officials. Students will learn about goal setting and decision-making, proper ways to show respect, social media etiquette and the dangers of running away and human trafficking. The Teen Awareness class was piloted last school year with three one-day classes. More than 150 parents and teenagers attended the classes.  “The class is one day, but the skills our participants learn are far more long-lasting,” said .... HCPS works through Harvey to serve clients, community. Published. on August 31, 2017. by.in. Newsletter. Evelyn Emdin, HCPS Kinder Emergency Shelter program manager, and the 14 youth under her watch worked together to devise a plan for additional food items on Sunday.They had been sheltered-in-place throughout Hurricane Harvey and remained optimistic.“It was so exciting and amazing to know the strength of these children,” Emdin said Tuesday.Emdin was one of several HCPS staff members who remained at the Youth Services Center throughout the record-breaking Houston disaster, and many more staff who remained committed to the community and their clients from the first day. “Judge Ed Emmett has encouraged staff to volunteer this week, while our buildings are closed. But what’s amazing about our HCPS staff is they didn’t need that encouragement,” said Joel Levine, HCPS executive director. “They were already in the community, helping the public and each other.”Community Youth Services (CYS) staff have volunteered at major shelters, such as those at the George R. Brown Convention Center and NRG Stadium, as well as those in their own communities. Kristen Ballard, a CYS program manager, said one of her staff members arranged the setup for a shelter.CYS .... HCPS Clinic prescribes back-to-school fun & health. Published. on August 1, 2017. by.in. Newsletter. John C., 14, gleefully raised his hand when his raffle number was called Saturday at the first-ever HCPS Integrated Healthcare Clinic Family Fun Day & Health Fair. He won a donated $25 gift card for ALDI.“What I’m going to do is get some stuff I really need,” John said. “What I really need are snacks! Because when I go to school, I’m going to need it.”John was one of more than 120 children who attended the fair, an effort for the HCPS Integrated Healthcare Clinic to help children and the community prepare for the coming school year.The fair included free vaccinations, school supplies, bike helmets, food, games and giveaways, many from sponsors. ALDI donated $1,000 in gift cards, the AT&T Pioneers donated school supplies, Cigna donated backpacks and Texas Children’s Hospital donated bike helmets and bike lights.Wesley Windom, of Respectful Zone Emergency Shelter, said he brought John and 15 other youth to the fair as a regular weekend outing. “This was a lot of fun for them,” Windom said. “A great way to spend a Saturday morning.” More than .... HCPS executive director highlights values in keynote speech. Published. on July 13, 2017. by.in. Newsletter. HCPS employees embodied the department’s core values during Thursday’s “Employee Appreciation Ceremony and Core Values Inauguration.”As part of the bi-annual all-staff Executive Forum,employees received awards and demonstrated the new HCPS values. More than 300 employeesparticipated in the event at the Power Center, divided between morning andafternoon sessions. Executive Director Joel Levine kicked off each session withthe keynote speech, explaining how the most recent HCPS initiative – first-evercore values – affects all other parts of HCPS and its clients. The HCPS values,released earlier this year, are: Help, Excellence, Accountability, Respect andTeamwork (H.E.A.R.T.). “They form the building blocks of our agency and helpus to define right and wrong, as well as help us determine the behaviors andperspectives that are valued within our culture,” Levine said.  “Culture is a living, breathing thing.” To showcase how important each HCPS value is to the overallmission, employees from each division then a delivered a brief presentationexhibiting each. The presentations took different forms: two as songs, one as arally and another as a teambuilding exercise. Following the presentations, employees who have reachedmilestone years with HCPS received .... Conference celebrates 'Superhero' support staff. Published. on June 13, 2017. by.in. Newsletter. The superheroesof HCPS and other Harris County offices are the administrative support staff(administrative assistants, cooks, cleaning staff, etc.), according to thespeakers and theme of the annual Dianne Bynum Administrative Support StaffConference.\"You takecare of us; you take care of the office,\" said HCPS Executive DirectorJoel Levine. \"You are our first contact (with the public) in manycases. How that client, that stakeholder, that public is treated, that tells astory about our agency -- or your agency.\"Participantspacked the conference rooms of the Harris County Department of Educationbuilding on June 2. This year's theme was: \"Supporting the Superhero inYou.\"The TrainingInstitute of HCPS has organized the conference for the past nine yearsto both train and celebrate support staff from organizationsthroughout the county. Theconference was named for Dianne Bynum, a former HCPS board president whochampioned the conferenceIn a uniquearrangement, leadership from participating organizations agree to take care ofthe office while their support staff members enjoy a full day of training --the same as any other staff member would. “It shows theircommitment and appreciation to us, by doing our work for us,” said Valencia A.Linton, who works at the front .... HCPS Clinic becomes first Center of Excellence in Harris County. Published. on May 16, 2017. by.in. Newsletter. TheHarris County Protective Services (HCPS) Integrated Healthcare Clinic, a uniqueclinic dedicated to treating the trauma of children in foster care, is now the firstFoster Care Center of Excellence in Harris County.  “Youreally are willing to go the extra mile to provide quality services to childrenwho are in foster care,” said Robert Wells, Superior Health ServicesTransformation projects manager. Wellspresented the Center of Excellence designation Tuesday at a special ceremony celebratingthe collaboration between HCPS, UTHealth, the Department of Family andProtective Services (DFPS) and Superior Health. “Weare proud to receive this designation,” said Joel Levine, HCPS executivedirector. “It is a reflection of the hard work our staff has done to ensurechildren with visible and invisible wounds can heal in a safe, invitingatmosphere.” SuperiorHealth gives the Center of Excellence title to clinics that meet a higherstandard of care for children in DFPS custody covered through the SuperiorHealth Medicaid plan. The HCPS Clinic is now the only clinic to receive thedesignation in Harris County and the second in Texas.  “We’vedeveloped the clinic into a true comprehensive medical home for children withCPS involvement by providing competent and compassionate .... JP Court Liaisons advise parents to Make It Right. Published. on May 11, 2017. by.in. Newsletter. JP Court Liaisons distributed information about HCPS and its youth programs at the \"Make It Right!\" event meant to aid Harris County parents in resolving outstanding low-level warrants. \"Parents shouldn’t have to worry about being pulled over on the way to drop their children off to school or being concerned when they take their teenager to get their driver’s license,\" said JP Court Program Specialist Shenetha Toliver. \"Those should be memory-building events, free of stress,\" added Dina Johnson, also a JP Court Program Specialist.Make It Right invited Harris County residents with warrants resulting from nonviolent misdemeanor offenses that were filed in Precincts 1 and 6 to attend the event and clear those pending cases. JP Court Liaisons work with teenagers who have Class C misdemeanors, and their families. They encourage parents to take part in any Make It Right event in order to be more effective parents.Eligible charges for Make It Right include, but are not limited to, failure to appear, public intoxication, disorderly conduct and theft of less than $100. Traffic offenses and felonies are not eligible. \"This .... HAY Center Prom Event outfits foster youth. Published. on March 30, 2017. by.in. Newsletter. Five years ago, Phyllis Ocean fitted a vision-impaired teenager in a maroon dress. She and another volunteer at The HAY Center Prom Readiness Event had helped the foster youth pick out the dress, silver shoes and accessories.“She just lit up; she looked radiant,” Ocean recalled recently. “All teenagers deserve to have that special moment” of finding the perfect prom outfit.Ocean, a member of the Houston Bar Association, was one of more than 90 volunteers who helped nearly 80 foster youth prepare their night-to-remember garb on March 27.Volunteer groups also included the Houston Young Lawyers Association, Benefit Bettie and Bellaire United Methodist Church.“We extend the most heart-felt thank you to every volunteer, staff member and donor who has contributed to this event for the past six years,” said Mary Green, director of The HAY Center. “Without their generosity, this event could never happen.”The HAY Center converted its entire West Clay Street building into a mini store, complete with racks of donated dresses and suits, ties, shoes, undergarments and jewelry. Each foster youth was treated to a personal shopper to help .... HCPS retirees honored for combined 125 years of dedication. Published. on November 21, 2016. by.in. Newsletter. HCPS proudly recognized four retirees whose totaled years of dedicated service to HCPS surpassed 125 years. The four retirees were: Debra Andrews Training Institute DirectorAndrews retired with 20 years of service. In her final position as Training Institute director, she headed the department revamp and helped develop a unique prevention assessment tool.Ross Galizio CYS SupervisorGalizio retired with 27 years of service to HCPS, finishing his tenure as a vital member of the Community Youth Services (CYS) team, which helps youth and their families through in-community crisis intervention.Claudia Flores Administrative SupportFlores retired with 43 years of service to HCPS. She held several administrative positions over her tenure, the last with the HCPS Parent/Teen Survival program.Robbie Pennington Accounting SupervisorPennington retired with 39 years of service. She was instrumental in the financial organization of the Guardianship Program, which HCPS acquired in 2003.. New HCPS board members: Sheila Aron & Darryl King. Published. on November 21, 2016. by.in. Newsletter. An author and a Houston-based entrepreneur joined the HCPS board this quarter, nearly filling the seats on the 15-member board.Sheila Aron is a parenting book author who has a passion for child abuse prevention. In October, Aron donated 100 copies of her book, “I’m Glad I’m Me: Weaving the Thread of Love From Generation to Generation” to foster parents.Darryl King is co-founder and CEO of management consulting firm Principle Partnering Group, LLC. King serves on several local and statewide boards for organizations dedicated to outreach, business and youth.Commissioner Steve Radack, Precinct 3, appointed Aron. Commissioner Jack Cagle, Precinct 4, appointed King.. Youth On B.O.A.R.D. vice president active in community, career. Published. on November 21, 2016. by.in. Newsletter. The unassuming teenager, slim and soft-spoken, took the stage. Suddenly, a sweet, smooth jazz rendition of “The Children are Our Future,” filled the Houston Junior League ballroom during the “At the Heart of Families Luncheon.”Kymora Anderson, 16, is that teenager. She has been part of the HCPS Youth On B.O.A.R.D. for three years, but it is just one item on her growing pre-collegiate resume.The high school junior sings all genres. She said Youth On B.O.A.R.D. gave her the confidence to pursue and thrive in other areas of her life. She was instrumental in the youth’s anti-stigma workshop and another improving youth and adult relationships.Youth On B.O.A.R.D. encourages teenagers to have a voice. By all appearances, Anderson has found hers.. HCPS sponsors brunch recognizing foster parents. Published. on November 16, 2016. by.in. Newsletter. HCPS sponsored an October brunch for nearly 40 foster parents in Harris County. Through a close partnership, the event was hosted by the Texas Department of Family and Protective Services and sponsored by HCPS.Paul Shanklin, of Precinct 4, served as master of ceremony, enriching the programming with a song and encouragement that all should enjoy the morning.The usual December event was held in October this year to relieve some of the holiday pressure and encourage family time. HCPS also arranged for an ice cream social where 26 foster youth could mingle while their guardians enjoyed brunch.. Subscribe. Receive the latest HCPS news right in your inbox.. Email. subscribe. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Contact-Us/Locations",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Contact Us. Locations. Location. Main Location. 2525 Murworth Drive. Houston, Texas 77054. Phone: 713-394-4000. Hours: 9am - 5pm. Youth Services Center. 6300 Chimney Rock Rd. Houston, TX 77081. Phone: 713-295-2500. Hours: 24 hours. The HAY Center. 1216 West Clay. Houston, TX 770019. Phone: 832-927-7000. Hours: 9am - 5pm. BEAR for CPS Kids. 2223 West Loop S. Houston, Texas 77027. Phone: 713-940-3087. Hours: 9am - 5pm. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/speakerrequest",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Contact Us. Request a Speaker. Request an HCPS Speaker. Harris County Protective Services has subject matter experts in many areas affecting the lives of children, youth and adults. Fill out the form below for one of these experts to present to your group (free of cost) about these areas or about the services offered at HCPS. Explore the HCPS website for more information about the services we offer. We will make our best attempt to fulfill all requests, though we ask for a two-week notice.. Request an HCPS Speaker. Topic for HCPS Speaker to address. HCPS programs. HCPS services for at-risk youth. HCPS services for vulnerable adults. HCPS services for children in CPS care. Bullying. Guardianship. Drug awareness. If other, please indicate topic. Name of Organization. Contact Name. Contact Phone. Phone Number. Email. Is your event at least two weeks in the future?. Yes. No. Date of Event. Month... Day... Year. Proposed Time of Event. 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. Hour.:. 0. 5. 10. 15. 20. 25. 30. 35. 40. 45. 50. 55. Minutes. AM. PM. Proposed Date and Time of Event. Month.-. Day.-. Year. 1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. Hour.:. 0. 5. 10. 15. 20. 25. 30. 35. 40. 45. 50. 55. Minutes. AM. PM. Duration of Event. 30 Minutes. 60 Minutes. 90 Minutes. 120 Minutes. 3 Hours. 4 Hours. 5 Hours. 6 Hours. 7 Hours. 8 Hours. Other. Address of Event. Street Address. Street Address 2. City. State / Province. Postal / ZipCode. Afghanistan. Albania. Algeria. American Samoa. Andorra. Angola. Anguilla. Antarctica. Antigua and Barbuda. Argentina. Armenia. Aruba. Australia. Austria. Azerbaijan. Bahamas. Bahrain. Bangladesh. Barbados. Belarus. Belgium. Belize. Benin. Bermuda. Bhutan. Bolivia. Bosnia and Herzegovina. Botswana. Bouvet Island. Brazil. British Indian Ocean Territory. British Virgin Islands. Brunei Darussalam. Bulgaria. Burkina Faso. Burundi. Cambodia. Cameroon. Canada. Cape Verde. Cayman Islands. Central African Republic. Chad. Chile. China. Christmas Island. Cocos. Colombia. Comoros. Congo. Cook Islands. Costa Rica. Croatia. Cuba. Cyprus. Czech Republic. Denmark. Djibouti. Dominica. Dominican Republic. East Timor. Ecuador. Egypt. El Salvador. Equatorial Guinea. Eritrea. Estonia. Ethiopia. Falkland Islands. Faroe Islands. Fiji. Finland. France. French Guiana. French Polynesia. French Southern Territories. Gabon. Gambia. Georgia. Germany. Ghana. Gibraltar. Greece. Greenland. Grenada. Guadeloupe. Guam. Guatemala. Guinea. Guinea-Bissau. Guyana. Haiti. Heard and McDonald Islands. Honduras. Hong Kong. Hungary. Iceland. India. Indonesia. Iran. Iraq. Ireland. Israel. Italy. Ivory Coast. Jamaica. Japan. Jordan. Kazakhstan. Kenya. Kiribati. Kuwait. Kyrgyzstan. Laos. Latvia. Lebanon. Lesotho. Liberia. Libya. Liechtenstein. Lithuania. Luxembourg. Macau. Macedonia. Madagascar. Malawi. Malaysia. Maldives. Mali. Malta. Marshall Islands. Martinique. Mauritania. Mauritius. Mayotte. Mexico. Micronesia. Moldova. Monaco. Mongolia. Montserrat. Morocco. Mozambique. Myanmar. Namibia. Nauru. Nepal. Netherlands. Netherlands Antilles. New Caledonia. New Zealand. Nicaragua. Niger. Nigeria. Niue. Norfolk Island. North Korea. Northern Mariana Islands. Norway. Oman. Pakistan. Palau. Panama. Papua New Guinea. Paraguay. Peru. Philippines. Pitcairn. Poland. Portugal. Puerto Rico. Qatar. Reunion. Romania. Russian Federation. Rwanda. S. Georgia and S. Sandwich Islands. Saint Kitts and Nevis. Saint Lucia. Saint Vincent and The Grenadines. Samoa. San Marino. Sao Tome and Principe. Saudi Arabia. Senegal. Seychelles. Sierra Leone. Singapore. Slovakia. Slovenia. Solomon Islands. Somalia. South Africa. South Korea. Soviet Union. Spain. Sri Lanka. St. Helena. St. Pierre and Miquelon. Sudan. Suriname. Svalbard and Jan Mayen Islands. Swaziland. Sweden. Switzerland. Syria. Taiwan. Tajikistan. Tanzania. Thailand. Togo. Tokelau. Tonga. Trinidad and Tobago. Tunisia. Turkey. Turkmenistan. Turks and Caicos Islands. Tuvalu. Uganda. Ukraine. United Arab Emirates. United Kingdom. United States. Uruguay. US Minor Outlying Islands. US Virgin Islands. Uzbekistan. Vanuatu. Venezuela. Viet Nam. Wallis and Futuna Islands. Western Sahara. Yemen. Yugoslavia. Zaire. Zambia. Zimbabwe. Country. Type of Event. Seminar. Conference. Workshop. Parent group. Civic Club meeting. Church meeting. Resource/Job Fair/Festival. OTHER. Title of Event. (Optional) Name of Preferred Speaker. Type of Audience. Business. Child care givers (day cares, etc.). Church. Civic groups. Legal professionals. Medical professionals. Parents. Other. Approx. # of Attendees. Will audio/visual equipment be available?. Yes. No. Additional Comments. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Publications",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Publications. Publications. Agency Publications. HCPS Newsletter/News Blog. HCPS transitioned from a traditional newsletter to a News blog in March 2017. For regular updates about HCPS programs and staff highlights, subscribe to our. News page. (near the bottom of the page) and follow us on social media.. View Previous Newsletters. HCPS Timeline. HCPS is celebrating its 50th year. The HCPS timeline includes successes and highlights over the past half century. HCPS has evolved into a comprehensive organization dedicated to bettering the lives of children and adults in Harris County.. 2017-2018 Annual Report. Each year, HCPS creates an annual report with statistics about the children, youth and families served through HCPS programs and the Harris County programs of the Texas Department of Family and Protective Services.. View Previous Annual Reports. Program Publications. Community Youth Services Resource Guide. The Community Youth Services team compiles an extensive guide of community-based help and services available to families who need assistance. Professionals throughout Harris County use the guide.. Natural Supports Resource Guide. The HCPS Clinic team compiles an annual guide of services available to families caring for children of their relatives through kinship placements. The compact guide is geared toward families.. CYD Needs Assessment. Each year, we review the needs and strengths of the communities served through the HCPS Community Youth Development (CYD) juvenile delinquency prevention grant programs in Gulfton (77081) and northern Pasadena (77506).. Pasadena. Gulfton. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Events",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Events. Events. Categories:. select. Select All. Adult Services. BEAR. Children's Services. HAY. HCPS. Youth Services. Locations:. select. Select All. Children's Museum of Houston. Murworth Building. The HAY Center. Youth Services Center. Dec02. BEARing Gifts: Volunteer Opportunity. Date:. Dec05. Guardianship Holiday Wrapping Party. Date:Thursday, December 5, 2019 9:00 AM.Category: Adult Services. Dec07. BEARing Gifts: Family Day. Date:. Dec09. HCPS Art Therapy. Date:Monday, December 9, 2019 1:00 PM.Category: Youth Services. Dec12. Houston Youth LEAD: All That Glitters Family Feast. Date:Thursday, December 12, 2019 6:00 PM.Category: Youth Services. 1. 2. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fAbout-Us%2fBoard-Members",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fGet-Involved%2fHCCPS-Fund",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fAdults",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Youth-Services/Kinder-Emergency-Shelter",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Youth Services. Kinder Emergency Shelter. Kinder Emergency Shelter. The Kinder Emergency Shelter is a coed 24-hour Harris County program licensed by the Texas Department of Family and Protective Services to provide emergency child-care services to youth from the ages of 12-17. Services include shelter and supervision, healthy nutrition, clothing, socialization and interpersonal skills, guided personal health and hygiene, education, crisis intervention and service planning. Kinder Shelter staff assist youth to:. Develop healthy self-esteem. Appreciate their unique worth. Learn to solve problems. Choose appropriate, healthy behaviors. Interact positively with other youth and adults. Learn independent living skills. Contact. 713-295-2700.for more information about our admission criteria.. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Youth-Services/SafetyNet-Program",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Youth Services. SafetyNet Program. Safety Net Services. Safety Net aims to reduce youth homelessness by preventing runaways and intervening in the lives of youth who have run away. The goal is to reduce family and school conflicts by providing a variety of services to create alternatives to running away. Safety Net provides: service coordination, assistance with emergency shelter placements and other safe housing alternatives, contracted individual and family therapy, and limited financial assistance. Eligible youth are ages 10-17 who are:. Currently homeless. Living in a voluntary placement away from a legal guardian. At-risk of running away. Contemplating runaway, or. Have a runaway history. For more information on Safety Net services, contact Safety Net Project Manager at. 713-295-2520. .. Youth Development. The Safety Net philosophy is that the best way to prevent young people’s involvement in risky behavior is to help them reach their full potential. Positive Youth Development provides activities to youth before, during or after services, including community projects and outreach aimed at developing leadership. The Youth Services Division offers three youth groups for youth who may need an outlet or a safe place to interact with other young people:. Gulfton and Pasadena Youth Advisory Committees (YAC). Youth Services Division Advisory Council. Youth on B.O.A.R.D. leadership council. The age requirements for these groups vary. Youth range from ages 12 to 21.. For more information on these groups, contact the Youth and Family Coordinator at. 713-295-2514. .. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Adult-Services/SJAC",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Adult Services. Senior Justice Assessment Center. Senior Justice Assessment Center. The Senior Justice Assessment Center (SJAC)— the first of its kind in Texas— serves the complex and unique needs of senior victims of abuse, neglect, and/or exploitation. SJAC collaborates with experts in geriatric medicine, social services, protective services, law enforcement, and civil and criminal prosecution, to provide services to seniors. As the senior population grows and the frequency of elder abuse rises in Harris County, SJAC aims to ensure the dignity of seniors by increasing awareness, education, and prosecution of elder abuse.. Services include assessments, multidisciplinary team meetings, case coordination, treatment referrals, education and research.. The multi-disciplinary team includes:. Harris County Protective Services (HCPS). Adult Protective Services (DFPS). Better Business Bureau Education Foundation. Harris County Attorney's Office. Harris County District Attorney's Office. Harris County Sheriff's Office. Harris Health System. Houston Police Department. UTHealth. Online. SJAC Referral Form. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Adult-Services/Rep-Payee",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Adult Services. Rep Payee. Representative (Rep) Payee. The Representative Payee Program assists low-income Harris County adults who are in need of financial management so that they can live independently.. The case manager is responsible for managing the client’s own finances. Services include:. Paying rent and other bills. Verifying that the basic needs of the client are met. If you are interested in the Rep Payee program, contact. 713-363-2300.for a referral.. Download. Referral Form. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Adult-Services/Guardianship",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Adult Services. Guardianship. Guardianship. At times, adults who no longer have ability to care for themselves need a guardian to guide them and protect them. The Harris County Guardianship Program (HCGP) steps into this role for adults who Harris County Probate Courts have determined are incapacitated due to age or mental and physical disabilities. Specially-trained case managers help clients maintain the highest degree of dignity, respect and independence while protecting them from abuse, neglect and exploitation.. Case managers organize and oversee:. Medical care. Daily needs (purchase of clothing, shoes, hygiene care, etc.). Housing. Property. Finances. Funerals (when necessary). Guardianship services are often a long-term commitment and continue until the client improves to the point that they are fully capable of maintaining their own affairs, the court finds a successor guardian; such as family or friends; or until the client passes away.. If you or someone you know is in need of a public guardian, contact. 713-363-2300. .. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin/ctl/SendPassword?returnurl=http://hcps.harriscountytx.gov/HCPSLogin",
        "text": "P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. If you forgot your password an email with a password reset link will be sent to you. Click on the link in that email and you will be taken to a page where you can then create a new password.. User Name:"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Youth-Services/CYS",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Youth Services. CYS. Community Youth Services. Community Youth Services (CYS) is a school-based crisis intervention, counseling and case coordination program that provides practical assistance to families of children and youth who are experiencing problems. In partnership with the local schools and other governmental entities, CYS services are available to students in fourteen Harris County school districts, the Pasadena Police Department and the Educational Services Division of the Harris County Juvenile Probation Department.. All services are voluntary and provided at no cost to the family. Appropriate referrals include, but are not limited to:. Parent-Child Conflict. School/academic. Mental health. Substance abuse. Runaway/homelessness. Pregnancy/Teen Parenting. Adolescent development. Grief. Download. Community Youth Services Resource Guide. Click in the map below to find out if you have a CYS case worker in your school district. If not, contact 832-927-6400 for. TRIAD. .. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Publications/Previous-Annual-Reports",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Publications. Previous Annual Reports. Previous Annual Reports. 2017 Statistics and Funding - Programs for 2018. 2016 Statistics and Funding - Programs for 2017. 2015 Statistics and Funding - Programs for 2016. 2014 Statistics and Funding - Programs for 2015. 2013 Statistics and Funding - Programs for 2014. 2012 Statistics and Funding - Programs for 2013. 2011 Statistics and Funding - Programs for 2012. 2010 Statistics and Funding - Programs for 2011. 2009 Statistics and Funding - Programs for 2010. 2008 Statistics and Funding - Programs for 2009. 2007 Statistics and Funding - Programs for 2008. 2006 Statistics and Funding - Programs for 2007. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Publications/Previous-Newsletters",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Publications. Previous Newsletters. ** HCPS transitioned from a traditional newsletter to a News blog in March 2017.. For regular updates about HCPS programs and staff highlights, subscribe to our. News page. (near the bottom of the page) and follow us on social media.**. Previous Newsletters. Volume 14 Number 1 - Winter 2017. Volume 13 Number 3 - Summer 2016. Volume 13 Number 2 - Spring 2016. Volume 13 Number 1 - Winter 2016. Volume 12 Number 3 - Fall 2015. Volume 12 Number 2 - Summer 2015. Volume 12 Number 1 - Spring 2015. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Events/ModuleID/15265/ItemID/172437/mctl/EventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Events. Events. BEARing Gifts: Family Day. Email this event to me @. Start Date/Time:. Saturday, December 7, 2019. (UTC-06:00) Central Time (US & Canada). End Date/Time:. Saturday, December 7, 2019. (UTC-06:00) Central Time (US & Canada). Description:. Enrolled Users:. Owned by. Luis Morales.On Friday, May 24, 2019. Return. Export. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Events/ModuleID/15265/ItemID/191328/mctl/EventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Events. Events. Guardianship Holiday Wrapping Party. Email this event to me @. Start Date/Time:. Thursday, December 5, 2019 9:00 AM. (UTC-06:00) Central Time (US & Canada). End Date/Time:. Thursday, December 5, 2019 12:00 PM. (UTC-06:00) Central Time (US & Canada). Category:. Adult Services. Description:. Enrolled Users:. Owned by. Luis Morales.On Thursday, November 21, 2019. Return. Export. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Events/ModuleID/15265/ItemID/172436/mctl/EventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Events. Events. BEARing Gifts: Volunteer Opportunity. Email this event to me @. Start Date/Time:. Monday, December 2, 2019. (UTC-06:00) Central Time (US & Canada). End Date/Time:. Friday, December 13, 2019. (UTC-06:00) Central Time (US & Canada). Description:. Sign up at www.bearesourcehouston.org. Enrolled Users:. Owned by. Luis Morales.On Friday, May 24, 2019. Return. Export. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Events/ModuleID/15265/ItemID/191330/mctl/EventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Events. Events. Houston Youth LEAD: All That Glitters Family Feast. Email this event to me @. Start Date/Time:. Thursday, December 12, 2019 6:00 PM. (UTC-06:00) Central Time (US & Canada). End Date/Time:. Thursday, December 12, 2019 8:00 PM. (UTC-06:00) Central Time (US & Canada). Category:. Youth Services. Description:. Attucks Middle School Students in the Houston Youth LEAD program will attend a dinner feast.. Enrolled Users:. Owned by. Luis Morales.On Thursday, November 21, 2019. Return. Export. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/Events/ModuleID/15265/ItemID/191329/mctl/EventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. Events. Events. HCPS Art Therapy. Email this event to me @. Start Date/Time:. Monday, December 9, 2019 1:00 PM. (UTC-06:00) Central Time (US & Canada). End Date/Time:. Monday, December 9, 2019 2:00 PM. (UTC-06:00) Central Time (US & Canada). Category:. Youth Services. Description:. Enrolled Users:. Owned by. Luis Morales.On Thursday, November 21, 2019. Return. Export. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fGet-Involved%2fWays-to-Help",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fNews-Events%2fEvents",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fNews-Events%2fPublications",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Get-Involved/Ways-to-Give-_old/Donate-Today",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Get Involved. Ways to Give _old. Donate Today. Donate Today. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fNews-Events%2fNews1",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fOur-Services%2fYouth-Services%2fSafetyNet-Program",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fOur-Services%2fYouth-Services%2fKinder-Emergency-Shelter",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/sjac-referral-form",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. SJAC Referral Form. Senior Justice Assessment Center - Referral Form. Eligibility. Please complete the following information about the senior you are referring to SJAC.. Harris County Resident. Yes. No. Age 65 or Older. Yes. No. Medically Stable. Yes. No. Referring Agency. Adult Protective Services. Better Business Bureau Education Foundation. Harris County Attorney's Office. Harris County District Attorney's Office. Harris County Guardianship. Harris County Sheriff's Office. Harris Health System. Houston Police Department. Ombudsman. The Attorney General of Texas. UTHealth. Other. Referring Agency Information. First Name. Last name. Title. Office Phone. Area Code. Phone Number. Office Fax. Area Code. Phone Number. Email. Client Information. First Name. Last Name. Birthdate. Month.-. Day.-. Year. Language. Translation / Communication Needs. Level of Education. Race. Asian. Black. Hispanic / Latino. Multiple Races / Bi-racial. Native American / Alaska Native. Native Hawaiian / Other Pacific Islander. White. Unable to Determine. Unknown - Not Reported by Victim. Unknown - Not Tracked by Agency. Gender. Marital Status. Address. City. Zip Code. Telephone. Area Code. Phone Number. Guardian Name. Guardian Phone. Area Code. Phone Number. Client Information -- Continued. Insurance. Physician's Name. Physician's Telephone. Area Code. Phone Number. Illness and Addictions. Medications and Dosage. Physical Functional Status: Appears.... Cognitive Status: Appears.... Living Setting. Lives With. Previous Reports of Abuse. No. Yes. Please Explain. Alleged Abuser / Defendant. First Name. Last Name. Date of Birth. Month.-. Day.-. Year. Gender. Language. Translation / Communications Needs. Relationship to Client. Primary Caregiver. Yes. No. Unknown. Lives with Client. Yes. No. Mental Illness. Yes. No. Address. City. Zip Code. Phone. Area Code. Phone Number. Reported Abuse. Other Agencies Involved. Reporting Party. Offense Report Number. Others with knowledge of abuse. Types of Reported Abuse Perpetrated By Others. PHYSICAL. NEGLECT. SEXUAL. FINANCIAL. EMOTIONAL. Abuse Resulted In. Serious Bodily Injury. Mental Suffering. Hospitalization. Death. Minor Medical Care. Members Requested. Adult Protective Services. Ombudsman. Harris County Attorney's Office. Harris County Sheriff's Office. Harris County District Attorney's Office. UTHealth. Harris County Guardianship. Houston Police Department. Narrative. Attach additional Documentation. Please send additional documentation to. SJAC@cps.hctx.net..  Please include the name of the client in the subject line of the email.. Your referral is complete.  Please click the \"Submit\" button below to transmit it for processing.. Ineligible Request. During our pilot period, we are only accepting referrals for individuals who are: age 65 and over, medically stable, and residents of Harris County.Also, referrals must come from one of our of partners.To report abuse/neglect of a senior or disabled person, please contact our partner, DFPS by Phone: 1-800-252-5400 or online. Texas Abuse Hotline.Privacy Notice: This form contains confidential information intended only for the use of the Senior Justice Assessment Center.  Authorized recipients of this information are prohibited from disclosing this information to any other party unless required to do so by law or regulation and are required to destroy the information after its stated need has been fulfilled.. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/News1/Author/luis-morales/aid/192",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. News. News. Featured. HCPS Executive DirectorDelivers Keynote Address. Published. on August 23, 2019. by. HCPS Content Manager.in. Featured News. ,. In the News. ,. Word from the ED. On August 16, 2019 Joel Levine, HCPS Executive Director, delivered a Keynote address to staff at the bi-annual Employee Appreciation Ceremony.  Within his remarks, Mr. Levine addressed agency accomplishments, challenges and his vision for the future.. EMPLOYEE APPRECIATION CEREMONY. August 16, 2019. KEYNOTE ADDRESS. Joel Levine. There were two young service man that enlisted in the Australian Navy. After many months at sea, they finally received a pass to spend the night in town when they docked at port. Naturally, the young men had too much to drink and were stumbling around trying to find their way back to the ship, when they bumped into a man in a decorated uniform, obviously a very .... .MNormal{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: normal;}.MNormalBold{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;}.MNormalRed{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: bold;color: #ff0000;}.MHead{font-family: Tahoma, Arial, Helvetica;font-size: 20px;font-weight: normal;color: #333333;}.MSubHead{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;color: #003366;}.MNormalTextBox{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: normal;}. In the News. Media coverage of HCPS programs and services. Most Recent. HCPS Executive DirectorDelivers Keynote Address. August 23,2019. 0. 262. HCPS Guardianship Program Fights the Summer Heat. July 9,2018. 0. 1975. BEARing Gifts Needs Your Help to Bring Holiday Cheer.... December 1,2017. 0. 3287. Restoring Holiday Spirits with Portable AM/FM Radios. December 1,2017. 0. 2871. Healing Through the Arts: Children's Art Exhibit. November 30,2017. 0. 2890. Read More ». Media Contact. Press Releases. For media requests, contact:. Estella Olguin. Senior Communications Manager. 713.410.9773. Luis Morales. Communications Specialist. 713.394-4067. Recent News. HCPS offers new parenting class. Published. on October 19, 2017. by.in. Newsletter. Free one-day parenting classes are now available through the HCPS JP Court Liaisons program. The second round of “Teen Awareness” classes begins this fall, in addition to parenting classes offered through the TRIAD Prevention Program. The classes are open to the general public, as well as those required by court. “We wanted to offer an additional service for those individuals who are due back to court, and there are no PLL (Parenting with Love and Limits) and PTS (Parent/Teen Survival) classes available or scheduled,” said Shenetha Toliver, JP Court program specialist. Teenagers and their parents will attend two separate group sessions during the class. Parents will discuss tips regarding their child’s grades and attendance and building relationships with school officials. Students will learn about goal setting and decision-making, proper ways to show respect, social media etiquette and the dangers of running away and human trafficking. The Teen Awareness class was piloted last school year with three one-day classes. More than 150 parents and teenagers attended the classes.  “The class is one day, but the skills our participants learn are far more long-lasting,” said .... HCPS works through Harvey to serve clients, community. Published. on August 31, 2017. by.in. Newsletter. Evelyn Emdin, HCPS Kinder Emergency Shelter program manager, and the 14 youth under her watch worked together to devise a plan for additional food items on Sunday.They had been sheltered-in-place throughout Hurricane Harvey and remained optimistic.“It was so exciting and amazing to know the strength of these children,” Emdin said Tuesday.Emdin was one of several HCPS staff members who remained at the Youth Services Center throughout the record-breaking Houston disaster, and many more staff who remained committed to the community and their clients from the first day. “Judge Ed Emmett has encouraged staff to volunteer this week, while our buildings are closed. But what’s amazing about our HCPS staff is they didn’t need that encouragement,” said Joel Levine, HCPS executive director. “They were already in the community, helping the public and each other.”Community Youth Services (CYS) staff have volunteered at major shelters, such as those at the George R. Brown Convention Center and NRG Stadium, as well as those in their own communities. Kristen Ballard, a CYS program manager, said one of her staff members arranged the setup for a shelter.CYS .... HCPS Clinic prescribes back-to-school fun & health. Published. on August 1, 2017. by.in. Newsletter. John C., 14, gleefully raised his hand when his raffle number was called Saturday at the first-ever HCPS Integrated Healthcare Clinic Family Fun Day & Health Fair. He won a donated $25 gift card for ALDI.“What I’m going to do is get some stuff I really need,” John said. “What I really need are snacks! Because when I go to school, I’m going to need it.”John was one of more than 120 children who attended the fair, an effort for the HCPS Integrated Healthcare Clinic to help children and the community prepare for the coming school year.The fair included free vaccinations, school supplies, bike helmets, food, games and giveaways, many from sponsors. ALDI donated $1,000 in gift cards, the AT&T Pioneers donated school supplies, Cigna donated backpacks and Texas Children’s Hospital donated bike helmets and bike lights.Wesley Windom, of Respectful Zone Emergency Shelter, said he brought John and 15 other youth to the fair as a regular weekend outing. “This was a lot of fun for them,” Windom said. “A great way to spend a Saturday morning.” More than .... HCPS executive director highlights values in keynote speech. Published. on July 13, 2017. by.in. Newsletter. HCPS employees embodied the department’s core values during Thursday’s “Employee Appreciation Ceremony and Core Values Inauguration.”As part of the bi-annual all-staff Executive Forum,employees received awards and demonstrated the new HCPS values. More than 300 employeesparticipated in the event at the Power Center, divided between morning andafternoon sessions. Executive Director Joel Levine kicked off each session withthe keynote speech, explaining how the most recent HCPS initiative – first-evercore values – affects all other parts of HCPS and its clients. The HCPS values,released earlier this year, are: Help, Excellence, Accountability, Respect andTeamwork (H.E.A.R.T.). “They form the building blocks of our agency and helpus to define right and wrong, as well as help us determine the behaviors andperspectives that are valued within our culture,” Levine said.  “Culture is a living, breathing thing.” To showcase how important each HCPS value is to the overallmission, employees from each division then a delivered a brief presentationexhibiting each. The presentations took different forms: two as songs, one as arally and another as a teambuilding exercise. Following the presentations, employees who have reachedmilestone years with HCPS received .... Conference celebrates 'Superhero' support staff. Published. on June 13, 2017. by.in. Newsletter. The superheroesof HCPS and other Harris County offices are the administrative support staff(administrative assistants, cooks, cleaning staff, etc.), according to thespeakers and theme of the annual Dianne Bynum Administrative Support StaffConference.\"You takecare of us; you take care of the office,\" said HCPS Executive DirectorJoel Levine. \"You are our first contact (with the public) in manycases. How that client, that stakeholder, that public is treated, that tells astory about our agency -- or your agency.\"Participantspacked the conference rooms of the Harris County Department of Educationbuilding on June 2. This year's theme was: \"Supporting the Superhero inYou.\"The TrainingInstitute of HCPS has organized the conference for the past nine yearsto both train and celebrate support staff from organizationsthroughout the county. Theconference was named for Dianne Bynum, a former HCPS board president whochampioned the conferenceIn a uniquearrangement, leadership from participating organizations agree to take care ofthe office while their support staff members enjoy a full day of training --the same as any other staff member would. “It shows theircommitment and appreciation to us, by doing our work for us,” said Valencia A.Linton, who works at the front .... HCPS Clinic becomes first Center of Excellence in Harris County. Published. on May 16, 2017. by.in. Newsletter. TheHarris County Protective Services (HCPS) Integrated Healthcare Clinic, a uniqueclinic dedicated to treating the trauma of children in foster care, is now the firstFoster Care Center of Excellence in Harris County.  “Youreally are willing to go the extra mile to provide quality services to childrenwho are in foster care,” said Robert Wells, Superior Health ServicesTransformation projects manager. Wellspresented the Center of Excellence designation Tuesday at a special ceremony celebratingthe collaboration between HCPS, UTHealth, the Department of Family andProtective Services (DFPS) and Superior Health. “Weare proud to receive this designation,” said Joel Levine, HCPS executivedirector. “It is a reflection of the hard work our staff has done to ensurechildren with visible and invisible wounds can heal in a safe, invitingatmosphere.” SuperiorHealth gives the Center of Excellence title to clinics that meet a higherstandard of care for children in DFPS custody covered through the SuperiorHealth Medicaid plan. The HCPS Clinic is now the only clinic to receive thedesignation in Harris County and the second in Texas.  “We’vedeveloped the clinic into a true comprehensive medical home for children withCPS involvement by providing competent and compassionate .... JP Court Liaisons advise parents to Make It Right. Published. on May 11, 2017. by.in. Newsletter. JP Court Liaisons distributed information about HCPS and its youth programs at the \"Make It Right!\" event meant to aid Harris County parents in resolving outstanding low-level warrants. \"Parents shouldn’t have to worry about being pulled over on the way to drop their children off to school or being concerned when they take their teenager to get their driver’s license,\" said JP Court Program Specialist Shenetha Toliver. \"Those should be memory-building events, free of stress,\" added Dina Johnson, also a JP Court Program Specialist.Make It Right invited Harris County residents with warrants resulting from nonviolent misdemeanor offenses that were filed in Precincts 1 and 6 to attend the event and clear those pending cases. JP Court Liaisons work with teenagers who have Class C misdemeanors, and their families. They encourage parents to take part in any Make It Right event in order to be more effective parents.Eligible charges for Make It Right include, but are not limited to, failure to appear, public intoxication, disorderly conduct and theft of less than $100. Traffic offenses and felonies are not eligible. \"This .... HAY Center Prom Event outfits foster youth. Published. on March 30, 2017. by.in. Newsletter. Five years ago, Phyllis Ocean fitted a vision-impaired teenager in a maroon dress. She and another volunteer at The HAY Center Prom Readiness Event had helped the foster youth pick out the dress, silver shoes and accessories.“She just lit up; she looked radiant,” Ocean recalled recently. “All teenagers deserve to have that special moment” of finding the perfect prom outfit.Ocean, a member of the Houston Bar Association, was one of more than 90 volunteers who helped nearly 80 foster youth prepare their night-to-remember garb on March 27.Volunteer groups also included the Houston Young Lawyers Association, Benefit Bettie and Bellaire United Methodist Church.“We extend the most heart-felt thank you to every volunteer, staff member and donor who has contributed to this event for the past six years,” said Mary Green, director of The HAY Center. “Without their generosity, this event could never happen.”The HAY Center converted its entire West Clay Street building into a mini store, complete with racks of donated dresses and suits, ties, shoes, undergarments and jewelry. Each foster youth was treated to a personal shopper to help .... HCPS retirees honored for combined 125 years of dedication. Published. on November 21, 2016. by.in. Newsletter. HCPS proudly recognized four retirees whose totaled years of dedicated service to HCPS surpassed 125 years. The four retirees were: Debra Andrews Training Institute DirectorAndrews retired with 20 years of service. In her final position as Training Institute director, she headed the department revamp and helped develop a unique prevention assessment tool.Ross Galizio CYS SupervisorGalizio retired with 27 years of service to HCPS, finishing his tenure as a vital member of the Community Youth Services (CYS) team, which helps youth and their families through in-community crisis intervention.Claudia Flores Administrative SupportFlores retired with 43 years of service to HCPS. She held several administrative positions over her tenure, the last with the HCPS Parent/Teen Survival program.Robbie Pennington Accounting SupervisorPennington retired with 39 years of service. She was instrumental in the financial organization of the Guardianship Program, which HCPS acquired in 2003.. New HCPS board members: Sheila Aron & Darryl King. Published. on November 21, 2016. by.in. Newsletter. An author and a Houston-based entrepreneur joined the HCPS board this quarter, nearly filling the seats on the 15-member board.Sheila Aron is a parenting book author who has a passion for child abuse prevention. In October, Aron donated 100 copies of her book, “I’m Glad I’m Me: Weaving the Thread of Love From Generation to Generation” to foster parents.Darryl King is co-founder and CEO of management consulting firm Principle Partnering Group, LLC. King serves on several local and statewide boards for organizations dedicated to outreach, business and youth.Commissioner Steve Radack, Precinct 3, appointed Aron. Commissioner Jack Cagle, Precinct 4, appointed King.. Youth On B.O.A.R.D. vice president active in community, career. Published. on November 21, 2016. by.in. Newsletter. The unassuming teenager, slim and soft-spoken, took the stage. Suddenly, a sweet, smooth jazz rendition of “The Children are Our Future,” filled the Houston Junior League ballroom during the “At the Heart of Families Luncheon.”Kymora Anderson, 16, is that teenager. She has been part of the HCPS Youth On B.O.A.R.D. for three years, but it is just one item on her growing pre-collegiate resume.The high school junior sings all genres. She said Youth On B.O.A.R.D. gave her the confidence to pursue and thrive in other areas of her life. She was instrumental in the youth’s anti-stigma workshop and another improving youth and adult relationships.Youth On B.O.A.R.D. encourages teenagers to have a voice. By all appearances, Anderson has found hers.. HCPS sponsors brunch recognizing foster parents. Published. on November 16, 2016. by.in. Newsletter. HCPS sponsored an October brunch for nearly 40 foster parents in Harris County. Through a close partnership, the event was hosted by the Texas Department of Family and Protective Services and sponsored by HCPS.Paul Shanklin, of Precinct 4, served as master of ceremony, enriching the programming with a song and encouragement that all should enjoy the morning.The usual December event was held in October this year to relieve some of the holiday pressure and encourage family time. HCPS also arranged for an ice cream social where 26 foster youth could mingle while their guardians enjoyed brunch.. Subscribe. Receive the latest HCPS news right in your inbox.. Email. subscribe. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fOur-Services%2fAdult-Services%2fGuardianship",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fOur-Services%2fAdult-Services%2fRep-Payee",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/News1/hcps-offers-new-parenting-class",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. News. News. Featured. HCPS Executive DirectorDelivers Keynote Address. Published. on August 23, 2019. by. HCPS Content Manager.in. Featured News. ,. In the News. ,. Word from the ED. On August 16, 2019 Joel Levine, HCPS Executive Director, delivered a Keynote address to staff at the bi-annual Employee Appreciation Ceremony.  Within his remarks, Mr. Levine addressed agency accomplishments, challenges and his vision for the future.. EMPLOYEE APPRECIATION CEREMONY. August 16, 2019. KEYNOTE ADDRESS. Joel Levine. There were two young service man that enlisted in the Australian Navy. After many months at sea, they finally received a pass to spend the night in town when they docked at port. Naturally, the young men had too much to drink and were stumbling around trying to find their way back to the ship, when they bumped into a man in a decorated uniform, obviously a very .... .MNormal{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: normal;}.MNormalBold{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;}.MNormalRed{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: bold;color: #ff0000;}.MHead{font-family: Tahoma, Arial, Helvetica;font-size: 20px;font-weight: normal;color: #333333;}.MSubHead{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;color: #003366;}.MNormalTextBox{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: normal;}. Recent News. Recent HCPS Happenings. HCPS offers new parenting class. Published. on October 19, 2017. by.in. Newsletter. Free one-day parenting classes are now available through the HCPS. JP Court Liaisons program.. The second round of “Teen Awareness” classes begins this fall, in addition to parenting classes offered through the TRIAD Prevention Program. The classes are open to the general public, as well as those required by court.. “We wanted to offer an additional service for those individuals who are due back to court, and there are no PLL (Parenting with Love and Limits) and PTS (Parent/Teen Survival) classes available or scheduled,” said Shenetha Toliver, JP Court program specialist.. Teenagers and their parents will attend two separate group sessions during the class. Parents will discuss tips regarding their child’s grades and attendance and building relationships with school officials. Students will learn about goal setting and decision-making, proper ways to show respect, social media etiquette and the dangers of running away and human trafficking.. The Teen Awareness class was piloted last school year with three one-day classes. More than 150 parents and teenagers attended the classes.. “The class is one day, but the skills our participants learn are far more long-lasting,” said Dina Johnson, JP Court program specialist.. Activities for the parents include creating a task list to aid attendance monitoring of their students and writing a letter of praise to their student, which the facilitators mail the following week on their behalf.. “We aim for parents to feel empowered and students to feel valued,” Johnson said. “Our experience is once they feel this, the families thrive.”. Teen Awareness classes are offered once a month.. Follow HCPS on Facebook and Twitter for updated information regarding the Teen Awareness classes. You may also contact any JP Court Liaison at the local JP Court or your precinct with questions about the class.. Related Articles. HCPS Executive DirectorDelivers Keynote Address. EMPLOYEE APPRECIATION CEREMONY. August 16, 2019. KEYNOTE ADDRESS. Joel Levine. There were two young service man that enlisted in the Australian Navy. After many months at sea, they finally received a pass to spend the night in town when they docked at port. Naturally, the young men had too much to drink and were stumbling around trying to find their way back to the ship, when they bumped into a man in a decorated uniform, obviously a very high ranking officer. Young man, do you know who I am; shouted the officer. The young men looked at each other and one said; this is just great-we don’t know where we are and he doesn't know who he is.. In the three years since I have accepted the position of Executive Director of Harris County Protective Services for Children and Adults, it has felt that way at times. I have worked hard to tell the story of HCPS, make judgement calls, balance personalities, needs and goals and frankly try to be a little less stupid every day. I have good days and bad days. This is OK. Jamie Smirnoff, the founder of Ring said “I hope I have bad days. That means you’re fighting and going forward. It’s like when you’re skiing: if you don’t fall that means you’re not challenging yourself. You don’t want those falls to kill you, but you still want to fall.”. I assumed the position of Executive Director with the vision of moving an agency with a lot of strengths and potential forward. This strong, potential filled agency had its share of internal turmoil just under the surface and was stagnate to unlocking that potential; stifling its ability to achieve new heights. Jacqueline Novogratz, founder and CEO of Acumen, said that leadership is learning to balance (and hold) the audacity to dream a different world with the humility to start with the world as it is. Leadership is about defining reality and inspiring hope. I found many people at all levels of this agency standing ready with me to start the journey forward. They had the courage to look at things with honesty, communicate with transparency, and encourage me to continue to move forward into the changes needed to unlock new potential.. The position of Executive Director of Harris County Protective Services for Children and Adults is a complex position. The position serves as the Department Head with fiduciary responsibility to Harris County Commissioner’s Court and the appointed Harris County Child Welfare Board. The Director also relates to two non-profit boards (The BEAR Board and the HAY Center Foundation) for two public-private arrangements for services to children and youth that the County cannot completely fund on its own. Additionally the Director also relates to the Harris County Protective Services Foundation that raises funds to support the Department. The Department has over 350 staff to support 19 program areas serving young children and families through aged and disabled adults. Each program has a unique set of services with output and outcome measures. The duties of the Executive Director, and the duties of other leaders and staff within the agency can be daunting. Vision and core values must guide us as we proceed to bring improvements.. I am proud of what we as “Team HCPS” have accomplished over the past three years. I would like to celebrate the achievements of all of you who came together to accomplish so much.. Programmatically:. We were awarded the Center of Excellence Designation from Superior Health Plan for our Clinic to provide integrated physical and behavioral health care for children in child protective services.. We launched the Senior Justice Assessment Center, the first of its kind in Texas and one of only a few across the country to address restoration and prosecution for victims of elder abuse and exploitation.. We implemented the care coordination for the Model of Care for female child victims of sex trafficking with the Governor’s Office.. We initiated the Law Enforcement Assisted Diversion Program at Attucks Middle School with the Harris County Precinct One Commissioner Rodney Ellis, the City of Houston, My Brother’s Keeper Program and Houston ReVision.. We implemented TBRI, a Trauma Informed Care model, in the Shelter and hope to expand this throughout the Agency over time.. We expanded the Nurturing Parent Evidenced Based Home Visiting Program for families with children ages 0-5 in the Family Based Safety Services Stage of Service and are providing it at the Reed Road Housing Program with New Hope Housing.. We expanded the Bridge Housing and Transition Coach Programs for young adults exiting the state foster care system. We are now working with the Harris County Housing Authority, Harris County Community Services Department and the HAY Center Foundation on the possibility of a HAY Center campus.. BEAR is launching the HEART Gallery for Harris County. This is a proven model for helping to find permanent loving homes for children who have been in the system.. This is real stuff! We are doing important, essential, life altering things in the community. We are impacting lives, changing lives day in and day out. When I accepted the position of Executive Director, many of the things just listed were only visions and ideas. You allowed me to set the vision and with the Executive team begin to chart the course. But the destination to reality and existence could not be reached without you. When released to create, so many of you stepped up and made ideas become reality. Herb Kelleher , the late CEO of Southwest Airlines, often said that “Power is for weightlifting and boats, leadership is about responsibilities.” It is my responsibility to create an environment where these excellent contributions can take place. Thank you all for adapting to the environment of excellence and executing great things. Here are a few more great things that we have made real.. Internally:. We have developed and implemented the HEART Values as a framework to guide our work and our interactions with our clients, stakeholders and each other.. We have revamped the Board and committee process to engage the Board more in our work. Whereas we experienced a revolving door of board members leaving and new Board members coming on year to year, the board has been stable in that only two members have left within the last 3 years.. We created the leadership position of Organizational Development and Strategic Initiatives to guide us in planning forward and to identify and address efficiencies within the Agency.. We have identified, developed and staffed new levels of leadership in critical support areas of IT, Operations and Human Resources.. We passed our COA reaccreditation with high scores in every area.. The ten year anniversary of the Diane Bynum Administrative Support Conference was the best attended ever. We continue to keep our commitment of providing quality training for our Administrative Support staff as well for our partners.. Of all of these accomplishments; I want to talk today about the newest one that I am extremely proud of. One year ago our Board approved the 2018-2020 Strategic Plan for HCPS. This strategic plan is different than others that preceded it. This Plan was designed with input from many people including staff, board, stakeholders, family partners and youth on board. It truly reflects our agreements on the future condition of HCPS. I had two conditions for a Strategic Plan: 1). The plan addresses the agency as a whole. Past plans have focused on individual programs or Divisions as if we were a system of agencies and not one agency. 2). the plan must be fully implemented. Early on in my tenure as Executive Director, I asked my colleagues, Judge John Specia, former Commissioner of DFPS and Katie Olse, Executive Director of the Texas Alliance of Children and Family Services to do an analysis of the programs and services that are part of the partnership with DFPS. The team reviewed reams of historic and current data in addition to interviews with key staff and stakeholders and observation. In the report was a sentence that read: What became apparent is HCPS has engaged in a number of endeavors in the past that involved a lot of good discussion, good ideas, good potential solutions, and even good plans. The problem has come with follow through. Many of the efforts called for actions that were only partially implemented at best. The Strategic Plan that we have put forward meets these two conditions. We made a commitment with our Board to revisit our progress implementing our strategies on a regular basis and communicate what we found and when we need to “track and adjust”.. The Plan addresses three overarching strategies related to culture, communication and strategic partnerships:. The first strategy is all about strengthening our organizational culture through becoming an agency that lives by our H.E.A.R.T Values. Two years ago when we rolled out the values at this meeting I spoke a lot about the importance of culture. Peter Drucker, leadership expert and author, was quoted as saying that culture eats strategy for breakfast. Introducing the values was the easy part. Implementing the values in an agency of over 350 staff and a rich history is a challenge. It has been a faith walk at times.. A lot of work has been done over the past two years to display and reinforce the values as well as recognize staff for living them. To bring the Core Values into all that we do, we have completed and are in the process of rolling out the new annual performance evaluation tool that translates the values into expectations, priorities and behaviors with colleagues, staff and self. To accompany this, we have also developed a new conference form that accompanies the evaluation that also incorporates the values into our monthly review of activities, outputs and outcomes.. We want HCPS to be a career choice for staff at all levels, and we want to create opportunities for them to develop their skills beyond the normal job functions. We are looking at the classification system for consistency across the agency in regard to education and experience and building a career track within each classification. We now have a system where internal staff may not meet the qualifications for a promotion to a supervisory position. We are looking at lead worker positions and hope to pilot this in some programs soon.. Recently, I met with a focus group consisting of tenured staff; designed to check my own perception on things. I wanted to ask a diverse group of tenured employees - what is the difference in how they experience the agency now as opposed to four or five years ago. The first comment in that session was “we are not afraid to terminate now”. We have become very good and cutting our losses quickly when we have people who are not living by our values or performing at expected levels. We also need to become very good at hiring the right people to replace them instead of similar individuals who also fail to exhibit our core values. To address this pattern of not hiring the best staff possible, I have charged the Human Resources Committee to revamp our hiring process to include more Human Resources involvement and consultation throughout the process and have consistent questions where we look more at cultural fit than at competency and skill level. Herb Kelleher of Southwest Airlines frame was quoted as saying “You don’t hire for skills, you hire for attitude. You can always teach skills”. This action will strengthen our organizational culture through becoming an agency that lives by our H.E.A.R.T Values. This is what our first strategy is about:. The overarching strategy also has an objective related to strengthening agency data. This is an issue that we have needed to address. This past January we welcomed a new County Judge in the honorable Lina Hidalgo and a new Commissioner, the honorable Adrian Garcia. One of the early actions of the new Commissioner’s Court was to approve the hiring of an outside consultant to conduct a countywide management and organizational study to review the criteria for evaluating departmental performance and the efficiency, necessity, and effectiveness of service delivery based on best practices. We need to contextualize our data to tell a more complete story of our strengths and challenges. To this end, we have increased the staff in our Continuous Quality Improvement area to look at the data that is currently being collected and to collect the right kind of data. We recognize that we need assistance in this area and as a result have reached out to the Texas Policy Lab at Rice University. The Policy Lab collaborates with state and local governments to deliver data driven solutions. Starting with the Youth Services Division, the Policy Lab will help us to analyze the data we collect and create executive dashboards for management.. The second strategy pertains to increasing community awareness and engagement of HCPS Services. We need to develop a concurrent communications strategy that allows us to define our own narrative and help tell the story of our good work, both internally and externally. Through greatly increased Speaker’s Bureau activity and hosting tables and conferences and fairs, expanded social media presence and keeping the new web site up to date, we are doing a good job of making the community aware of who we are and the free services and resources available. We have added the “Rained Out” agency text alert system for essential internal communications.. Let’s talk about the biggest bugaboo under this strategy. In objective 2.2 on “Communicate a more effective message of the Agency’s Brand by December 2020” the first action item reads: Study the positive and negative impact of the agency name through 2018. Yes—I allowed this to be in the plan. Discussion of a name change is not a new discussion. I remember Board members bringing this up well over 10 years ago. There was concern at the time that the negative publicity about our DFPS partner was impacting the reputation of HCPS. This agency originated in 1966 to provide local support for the state child welfare program in Harris County. This is what Harris County Children’s Protective Services that later became Harris County Protective Services for Children and Adults when the Guardianship Program came over in 2003 was known for. It was our mission and it was a very effective partnership for many years. After 16 years, I, our Executive Team and Board felt it could be time to investigate how change could help improve our presence in the community.. I came into this position not prepared to revisit this issue. As I moved forward in this position, it became evident that we have grown as an agency in our School and Community Based Prevention Services in the Youth Services Division and with the addition and expansion of the Adult Services Division. Our partnership with DFPS for child welfare support is one of the things that we do, but we are now so much more. Our name is not reflective of this. Secondly, the message was brought very clearly to me that our name is holding us back; especially in our Youth Services Division where we provide voluntary services to the community. People were suspicious about participating in services and we spent a lot of time explaining who we are not than who we are. I am not an expert in communications but I realize that having to use all your valuable engagement time talking about who you are not is not a good communications strategy.. The staff and board workgroup assigned to this objective engaged with Athena, the student run marketing group at Rice University. Athena did a thorough analysis of the name including over 300 people on the street interviews in the community where I would say it was unanimous that people thought we were the state child welfare agency. The recommendation from Athena left no doubt of what needs to happen. I can tell you today that we will change our name. This is a process and I ask for patience. Where are we are in the process? - We are collecting suggested names from workgroup members, staff, and stakeholders. We will be presenting the first list of names to our Board at our meeting next week. We will narrow this down to a short list of 2-4 names at which time we will again take to the streets to field test these names. The Board will then select the new name which we will take to Commissioner’s Court for approval. I have already spoken to a couple of Commissioners and do not anticipate that we will not have an issue with passage. The final step will be Legislative action to change our name statute in the 87th Legislative session in 2021. We can begin using our new name once we receive Commissioner’s Court approval and do not have to wait for the Legislature. This will involve resources dedicated to the rebranding campaign that accompanies a name change. We will be working with a communications consultant on this. A name change is not an easy task. There is always inherent risk involved. Martin Luther King, Jr. said that we don’t have to see the whole staircase, just take the first step. We have taken that step. I look forward to moving up the staircase to a higher level with you all.. I want to reiterate and I will talk more about this with the next strategy that this does not in any way diminish our partnership with DFPS. The services and resources that we provide to support the state child welfare program in Harris County will still be an integral part of what we do as an agency is support of our mission. I believe that we can do this while at the same time building our own name identity that truly represents all that we do at HCPS for all of our clients. This may even serve to strengthen our relationship.. The third strategy pertains to building new relationships and strengthening current partnerships to better leverage all programs. We have over 500 partnerships throughout the Agency. HCPS is an enviable position to serve as a leader and facilitator in the community to pilot good ideas and bring programs and collaboration to scale. We see this with the Senior Justice Assessment Center, TRIAD, the Child Sex trafficking Initiative, CYS, Integrated Health Care, faith based initiatives, etc.. Our work on this goal started with our closest partner and the one that I believed was in need of the most attention, the Department of Family and Protective Services. Since our beginning in 1966 we have provided county funded and contracted services for a well-developed county –state child welfare partnership in Harris County. These services and contracts grew over time with some ebb and flow through the years. I know that there are people who wish that we could just keep providing the services that we are proving for DFPS year after year. Unfortunately, this is not reality. DFPS has gone through many transformations over the years as new Commissioners have come and left. With this, needs and priorities change and what worked yesterday may not work today. One of my concerns prior to my taking this position is that while DFPS kept transforming we were staying stagnant, running in place and that sooner or later this would catch up with us. If we don’t keep up with what is happening with our partners we will become irrelevant. It is my job to see that this does not happen.. In April of 2018 we held our first Board Retreat in over 4 and half years. For the afternoon of the Retreat, I invited the DFPS-CPS state and regional leadership team. The Associate Commissioner and Director of Field at State office participated along with the CPS Regional Director for Harris County. Former DFPS Commissioner Judge John Specia, facilitated the discussion. We had an honest conversation about how the state and county each view this partnership and what the current priorities are for the Department. We looked at how Harris County can best position itself to address these priorities. From this discussion and follow up discussions we learned that expansion of the Integrated Health Care Model to include CANS and Assessments, Residential Services through Kinder Emergency Shelter, expansion of services through HAY Center to expand mentoring and include housing options and expansion of the Nurturing Parent Program for placement prevention are how the County could best partner with the Department.. The retirement of the Children’s Services Administrator last fall meant a series of changes would be coming to Children’s Services. Instead of moving into just replacing the administrator we realized this movement gave us an opportunity to look at ways to improve, innovate, and align our current Division and the Programs it contains. Our Executive Team partnered with Division staff and others to gather data and collaborate to create a reorganization plan. In this plan some modifications were made to the current structure of the Division. The goal of the restructuring was to serve clients in the most efficient and excellent manner possible.. Following a thorough process of staff feedback, observation and consultation with both internal and external stakeholders we developed various models of how the Division could be integrated and even though it may look different, current services being offered would be implemented in a more efficient way. We chose a model that integrates the medical, behavioral health and assessment services for children in one location. The Division will be renamed the Integrated Health Services Division. This model allows the agency to provide current services in a more efficient and integrated manner. It also sets us up to move forward into the future with a structure to support new directions. In this model, we have eliminated the Children’s Crisis Care Center, AKA the 4C’s though not the services. Under a new Division Director, the services are organized under three lanes 1) Medical 2) Behavioral Health and 3) Assessment. During the process, we engaged the University of Texas Medical School that we contract with for Pediatric and Psychiatric Services to complete a deep dive evaluation of our medical processes. We are still working on this aspect of the restructuring. The plan will include the Medical lane expanding the hours to some evenings and Saturday mornings. The Permanency Program will remain under Ms. Anna Bell in Organizational Development as we continue to work with DFPS on the permanency model with a greater focus on Region 6A. A new organization chart will be sent shortly that will reflect this new structure to begin next month. I would like to thank Jeff Alexander, Anna Bell, Claudia Gonzalez and Ginger Harper who assumed additional responsibilities since this past November to assure that the Children’s Services Division continued to operate within the HEART Values during this transition. I would also like to extend a thanks to all Children’s Services staff for continuing to provide excellent service for our clients in the midst of disruption. They welcomed different leadership styles and worked well with one another on collaboration of reorganization needs and to provide coverage in all areas.. Also, the current Youth Service Division structure was created in 2011 after the agency moved from a program structure to a divisional structure. Since that time, new programs have been established and other programs have expanded, restructured and/or merged. Under the existing structure there was one YSD Administrator and one YSD Program Manager that provided division-wide oversight. With the many program changes, responsibility and oversight have been impacted and are no longer divided in an efficient and equitable way in which to effectively manage the programs.. For the past 11 months, along with Ginger Harper and Jeff Alexander, we have evaluated the YSD programs and the current structure. Those efforts resulted in a strategic plan to re-organize the division.. Integration of support functions and resources to improve and streamline services was the goal. The re-organization plan synergizes the programs, strengthens infrastructure leadership and ultimately provides a better continuum of service delivery to families. This plan has already been implemented and will be included in the updated agency organization chart.. The strategy also speaks to evaluating the Senor Justice Assessment Center’s (SJAC) model of service delivery and build strategic partnership to accomplish targeted future growth and direction. We are working on this as SJAC continues to grow in numbers and reputation. We are moving the Manager position from the grant to the general fund so we can add additional case management while building program infrastructure.. We will look at building new relationships and strengthen current partnerships to better leverage all programs and services for children, youth and adults within this strategy.. In closing I want to say that this is a great time to be a proud team member of Harris County Protective Services for Children and Adults. The County has been reenergized with new leadership from Commissioner’s Court this past January. You heard from one of the new officials at the beginning of our session. The mission of HCPS is aligned with the values of the Court as they talk about diversion in the juvenile and adult justice systems, equity and transparency. I accepted this position knowing that there was a lot work to do to address the challenges that existed. I knew that this would not be a short process. I have learned that true system change takes a long time and is based on many complex variables. Peter Gruber, the founder of PolyGram Entertainment, said that short term thinking is not good in a marathon. I am proud of everything that we have accomplished together. It does feel like a different agency now in many ways. People are noticing, they are paying attention, but our journey of change leading to excellence is not over. There is more to come. Thank you for accepting the challenge and embracing the new things happening at HCPS.. There is a sign at the entrance to the Amazon Fulfillment Center in Kent, WA that reads “Welcome to Amazon. It is still Day One. Are you ready to make a difference?” I extend the same welcome and challenge to you. Welcome to HCPS – Are you still ready to make a difference? This is our opportunity; this is our time to be not just an OK agency but to be a great agency.. Thank you Team HCPS. I look forward to laboring beside you as we continue to implement positive change!. HCPS works through Harvey to serve clients, community. Evelyn Emdin,. HCPS Kinder Emergency Shelter.  program manager, and the 14 youth under her watch worked together to devise a plan for additional food items on Sunday.. They had been sheltered-in-place throughout Hurricane Harvey and remained optimistic.. “It was so exciting and amazing to know the strength of these children,” Emdin said Tuesday.. Emdin was one of several HCPS staff members who remained at the Youth Services Center throughout the record-breaking Houston disaster, and many more staff who remained committed to the community and their clients from the first day.. “Judge Ed Emmett has encouraged staff to volunteer this week, while our buildings are closed. But what’s amazing about our HCPS staff is they didn’t need that encouragement,” said Joel Levine, HCPS executive director. “They were already in the community, helping the public and each other.”. Community Youth Services.  (CYS) staff have volunteered at major shelters, such as those at the George R. Brown Convention Center and NRG Stadium, as well as those in their own communities. Kristen Ballard, a CYS program manager, said one of her staff members arranged the setup for a shelter.. CYS is a crisis intervention program housed in the community, primarily within schools, to provide counseling and assistance to youth experiencing crises.. “It’s normal that our staff would be among the first to volunteer,” Ballard said. “It’s very typical of who they are as people and the work that they do.”. Emdin and many staff members did not pause their work throughout the storm.. Staff with the. Guardianship Program.has worked with clients under the care of HCPS since Thursday to first ensure each had the necessary supplies and disaster plans, checked on each client throughout the storm and is now personally delivering items to clients.. Guardianship serves as the court-appointed guardian to more than 1,100 elderly and disabled adults in Harris County.. Meanwhile, Emdin, and staff ensured the needs of the youth were met throughout the event and kept youth in the shelter occupied with arts, crafts, movies and other activities throughout the weekend. An on-sight therapist, and staff from. TRIAD Mental Health.and. Intake Diversion.also assisted the shelter over the weekend and this week.. The Kinder Emergency Shelter is a temporary home-like facility for youth experiencing familial family crises.. Bernadette Green, HCPS operator/receptionist, was among the overnight staff who could not leave the building Saturday night and remained in place until Tuesday.. She helped answer calls from the community, directing them to resources and organizations who are accepting donations.. As Green prepared to leave for home Tuesday, she reflected on her four days in the building and all the stories she had heard about staff assisting clients.. “It says that we care,” she said. “We’re here for these kids and the community in any way we can be. I’m proud of that.”. HCPS executive director highlights values in keynote speech. HCPS employees embodied the department’s core values during Thursday’s “Employee Appreciation Ceremony and Core Values Inauguration.”. As part of the bi-annual all-staff Executive Forum,employees received awards and demonstrated the new HCPS values. More than 300 employeesparticipated in the event at the Power Center, divided between morning andafternoon sessions.. Executive Director Joel Levine kicked off each session withthe keynote speech, explaining how the most recent HCPS initiative – first-evercore values – affects all other parts of HCPS and its clients.. The HCPS values,released earlier this year, are: Help, Excellence, Accountability, Respect andTeamwork (H.E.A.R.T.).. “They form the building blocks of our agency and helpus to define right and wrong, as well as help us determine the behaviors andperspectives that are valued within our culture,” Levine said.  “Culture is a living, breathing thing.”. To showcase how important each HCPS value is to the overallmission, employees from each division then a delivered a brief presentationexhibiting each. The presentations took different forms: two as songs, one as arally and another as a teambuilding exercise.. Following the presentations, employees who have reachedmilestone years with HCPS received certificates and awards.. \"The HCPS story begins with you,\" Levine told employees.. HCPS Clinic becomes first Center of Excellence in Harris County. TheHarris County Protective Services (HCPS). Integrated Healthcare Clinic. , a uniqueclinic dedicated to treating the trauma of children in foster care, is now the firstFoster Care Center of Excellence in Harris County.. “Youreally are willing to go the extra mile to provide quality services to childrenwho are in foster care,” said Robert Wells, Superior Health ServicesTransformation projects manager.. Wellspresented the Center of Excellence designation Tuesday at a special ceremony celebratingthe collaboration between HCPS, UTHealth, the Department of Family andProtective Services (DFPS) and Superior Health.. “Weare proud to receive this designation,” said Joel Levine, HCPS executivedirector. “It is a reflection of the hard work our staff has done to ensurechildren with visible and invisible wounds can heal in a safe, invitingatmosphere.”. SuperiorHealth gives the Center of Excellence title to clinics that meet a higherstandard of care for children in DFPS custody covered through the SuperiorHealth Medicaid plan. The HCPS Clinic is now the only clinic to receive thedesignation in Harris County and the second in Texas.. “We’vedeveloped the clinic into a true comprehensive medical home for children withCPS involvement by providing competent and compassionate pediatric care for thewhole child,” said Dr. Kevin Lally, UTHealth chairman of the PediatricDepartment and Pediatric Surgery.. UTHealthprovides pediatric services to the clinic through Dr. Kim Cheung, who hasworked there since 1994, and psychiatric services through Dr. Chris Frederick.. TheIntegrated Healthcare Clinic was established in 1972 to provide specialtyservices to meet the needs of children who have experienced trauma and beenplaced in DFPS care. It has been recognized as a one-of-a-kind clinic foroffering medical, dental and mental health services in one location to allfoster children in Harris County.. “Whatsets the HCPS clinic apart from others is its wide range of services through ateam of providers who are specially-trained to work with traumatized childrenand their caregivers,” said Charlotte Donner, Clinical Services manager. “Wetreat the whole child and provide support to their caregivers.”. TheFamily Support Navigator program – added in 2015 as the clinic’s newestcomponent – provides caregivers of children in state care with a personalizedservice utilizing parents who have first-hand experience with the complexsocial services system. The navigators become one-on-one coaches to relativescaring for children in DFPS care, aiming to reduce caregiver stress byproviding community resources, parenting education and emotional support.. CJBroussard-White, Texas Department of Family and Protective Services Region 6A(Harris County) director, spoke during Tuesday’s event about the many ways HCPSaids the children in DFPS care, pointing out the difficulty of the work by theclinic staff.. “Iknow that it has not been easy, because when you think about the population thatyou serve, it can’t be easy,” Broussard-White said. “I know that you see a lotof things and you hear a lot of different things, but you have not given up.And because you have not given up, you have been recognized as a Center ofExcellence.”. If you orsomeone you know cares for children in DFPS care, contact the clinic at 713-295-2570.. HCPS retirees honored for combined 125 years of dedication. HCPS proudly recognized four retirees whose totaled years of dedicated service to HCPS surpassed 125 years.. The four retirees were:. Debra Andrews. Training Institute Director. Andrews retired with 20 years of service. In her final position as Training Institute director, she headed the department revamp and helped develop a unique prevention assessment tool.. Ross Galizio. CYS Supervisor. Galizio retired with 27 years of service to HCPS, finishing his tenure as a vital member of the Community Youth Services (CYS) team, which helps youth and their families through in-community crisis intervention.. Claudia Flores. Administrative Support. Flores retired with 43 years of service to HCPS. She held several administrative positions over her tenure, the last with the HCPS Parent/Teen Survival program.. Robbie Pennington. Accounting Supervisor. Pennington retired with 39 years of service. She was instrumental in the financial organization of the Guardianship Program, which HCPS acquired in 2003.. Word from the Executive Director: HCPS Core Values. I am delighted to introduce the new HCPS core values – principles that reflect what is truly important to us, how we go about doing our work and practices we will use in everything we do.. As Executive Director, I placed development of these core values as one of my top priorities. It is part of a larger initiative to strategically begin crafting the HCPS culture to better reflect the agency we have become. We were born as a child welfare board with one purpose and have expanded over the past 50 years into an entire county department with  more than a dozen programs serving vulnerable adults, children at-risk and abused and neglected children. We need values that bring our staff together to fulfill our vision to better the lives of children and adults in Harris County.. We wanted as many blocs of HCPS to help develop these core values, as they are the ones who know most about our needs and our clients’ needs. The HCPS Quality Improvement Team gathered online survey information from staff and the HCPS Board of Directors and formed a group of representatives from across the agency and parent partners. This group reviewed the survey information and past values recommendations to develop five core values:. Help – We HELP restore and transform lives.. Excellence – We strive for EXCELLENCE in carrying out our mission.. Accountability – We hold ourselves ACCOUNTABLE to our clients, our community and to each other.. Respect – We show RESPECT for the dignity and worth of every person.. Teamwork – We promote TEAMWORK by building trusting relationships.. These are values we will live and breathe every day in the workplace, from the caseworkers  and support staff to the Executive Director. The community will soon find these declarations posted at all our HCPS buildings. Internally, we will begin training, hiring and evaluating based on these beliefs.. In closing, I would like to leave you with a story I sent to staff with the release of our core values:. In 1962, President John F. Kennedy visited the NASA Space Center and stopped to speak with a janitor sweeping the floor. In response to the president’s question about what the janitor was doing, he responded, “I’m putting a man on the moon.” To some, this janitor was just cleaning the building. But he saw the bigger picture. He understood he was part of the overall mission. By keeping the facility clean, this man was helping make history.. Here’s the point: No matter your role at HCPS, you are contributing to the agency’s mission. And when HCPS embraces that type of attitude and belief system, incredible things can happen.. 3315 Views. In the News. Media coverage of HCPS programs and services. Most Recent. HCPS Executive DirectorDelivers Keynote Address. August 23,2019. 0. 262. HCPS Guardianship Program Fights the Summer Heat. July 9,2018. 0. 1975. BEARing Gifts Needs Your Help to Bring Holiday Cheer.... December 1,2017. 0. 3287. Restoring Holiday Spirits with Portable AM/FM Radios. December 1,2017. 0. 2871. Healing Through the Arts: Children's Art Exhibit. November 30,2017. 0. 2890. Read More ». Media Contact. Press Releases. For media requests, contact:. Estella Olguin. Senior Communications Manager. 713.410.9773. Luis Morales. Communications Specialist. 713.394-4067. Recent News. HCPS offers new parenting class. Published. on October 19, 2017. by.in. Newsletter. Free one-day parenting classes are now available through the HCPS JP Court Liaisons program. The second round of “Teen Awareness” classes begins this fall, in addition to parenting classes offered through the TRIAD Prevention Program. The classes are open to the general public, as well as those required by court. “We wanted to offer an additional service for those individuals who are due back to court, and there are no PLL (Parenting with Love and Limits) and PTS (Parent/Teen Survival) classes available or scheduled,” said Shenetha Toliver, JP Court program specialist. Teenagers and their parents will attend two separate group sessions during the class. Parents will discuss tips regarding their child’s grades and attendance and building relationships with school officials. Students will learn about goal setting and decision-making, proper ways to show respect, social media etiquette and the dangers of running away and human trafficking. The Teen Awareness class was piloted last school year with three one-day classes. More than 150 parents and teenagers attended the classes.  “The class is one day, but the skills our participants learn are far more long-lasting,” said .... HCPS works through Harvey to serve clients, community. Published. on August 31, 2017. by.in. Newsletter. Evelyn Emdin, HCPS Kinder Emergency Shelter program manager, and the 14 youth under her watch worked together to devise a plan for additional food items on Sunday.They had been sheltered-in-place throughout Hurricane Harvey and remained optimistic.“It was so exciting and amazing to know the strength of these children,” Emdin said Tuesday.Emdin was one of several HCPS staff members who remained at the Youth Services Center throughout the record-breaking Houston disaster, and many more staff who remained committed to the community and their clients from the first day. “Judge Ed Emmett has encouraged staff to volunteer this week, while our buildings are closed. But what’s amazing about our HCPS staff is they didn’t need that encouragement,” said Joel Levine, HCPS executive director. “They were already in the community, helping the public and each other.”Community Youth Services (CYS) staff have volunteered at major shelters, such as those at the George R. Brown Convention Center and NRG Stadium, as well as those in their own communities. Kristen Ballard, a CYS program manager, said one of her staff members arranged the setup for a shelter.CYS .... HCPS Clinic prescribes back-to-school fun & health. Published. on August 1, 2017. by.in. Newsletter. John C., 14, gleefully raised his hand when his raffle number was called Saturday at the first-ever HCPS Integrated Healthcare Clinic Family Fun Day & Health Fair. He won a donated $25 gift card for ALDI.“What I’m going to do is get some stuff I really need,” John said. “What I really need are snacks! Because when I go to school, I’m going to need it.”John was one of more than 120 children who attended the fair, an effort for the HCPS Integrated Healthcare Clinic to help children and the community prepare for the coming school year.The fair included free vaccinations, school supplies, bike helmets, food, games and giveaways, many from sponsors. ALDI donated $1,000 in gift cards, the AT&T Pioneers donated school supplies, Cigna donated backpacks and Texas Children’s Hospital donated bike helmets and bike lights.Wesley Windom, of Respectful Zone Emergency Shelter, said he brought John and 15 other youth to the fair as a regular weekend outing. “This was a lot of fun for them,” Windom said. “A great way to spend a Saturday morning.” More than .... HCPS executive director highlights values in keynote speech. Published. on July 13, 2017. by.in. Newsletter. HCPS employees embodied the department’s core values during Thursday’s “Employee Appreciation Ceremony and Core Values Inauguration.”As part of the bi-annual all-staff Executive Forum,employees received awards and demonstrated the new HCPS values. More than 300 employeesparticipated in the event at the Power Center, divided between morning andafternoon sessions. Executive Director Joel Levine kicked off each session withthe keynote speech, explaining how the most recent HCPS initiative – first-evercore values – affects all other parts of HCPS and its clients. The HCPS values,released earlier this year, are: Help, Excellence, Accountability, Respect andTeamwork (H.E.A.R.T.). “They form the building blocks of our agency and helpus to define right and wrong, as well as help us determine the behaviors andperspectives that are valued within our culture,” Levine said.  “Culture is a living, breathing thing.” To showcase how important each HCPS value is to the overallmission, employees from each division then a delivered a brief presentationexhibiting each. The presentations took different forms: two as songs, one as arally and another as a teambuilding exercise. Following the presentations, employees who have reachedmilestone years with HCPS received .... Conference celebrates 'Superhero' support staff. Published. on June 13, 2017. by.in. Newsletter. The superheroesof HCPS and other Harris County offices are the administrative support staff(administrative assistants, cooks, cleaning staff, etc.), according to thespeakers and theme of the annual Dianne Bynum Administrative Support StaffConference.\"You takecare of us; you take care of the office,\" said HCPS Executive DirectorJoel Levine. \"You are our first contact (with the public) in manycases. How that client, that stakeholder, that public is treated, that tells astory about our agency -- or your agency.\"Participantspacked the conference rooms of the Harris County Department of Educationbuilding on June 2. This year's theme was: \"Supporting the Superhero inYou.\"The TrainingInstitute of HCPS has organized the conference for the past nine yearsto both train and celebrate support staff from organizationsthroughout the county. Theconference was named for Dianne Bynum, a former HCPS board president whochampioned the conferenceIn a uniquearrangement, leadership from participating organizations agree to take care ofthe office while their support staff members enjoy a full day of training --the same as any other staff member would. “It shows theircommitment and appreciation to us, by doing our work for us,” said Valencia A.Linton, who works at the front .... HCPS Clinic becomes first Center of Excellence in Harris County. Published. on May 16, 2017. by.in. Newsletter. TheHarris County Protective Services (HCPS) Integrated Healthcare Clinic, a uniqueclinic dedicated to treating the trauma of children in foster care, is now the firstFoster Care Center of Excellence in Harris County.  “Youreally are willing to go the extra mile to provide quality services to childrenwho are in foster care,” said Robert Wells, Superior Health ServicesTransformation projects manager. Wellspresented the Center of Excellence designation Tuesday at a special ceremony celebratingthe collaboration between HCPS, UTHealth, the Department of Family andProtective Services (DFPS) and Superior Health. “Weare proud to receive this designation,” said Joel Levine, HCPS executivedirector. “It is a reflection of the hard work our staff has done to ensurechildren with visible and invisible wounds can heal in a safe, invitingatmosphere.” SuperiorHealth gives the Center of Excellence title to clinics that meet a higherstandard of care for children in DFPS custody covered through the SuperiorHealth Medicaid plan. The HCPS Clinic is now the only clinic to receive thedesignation in Harris County and the second in Texas.  “We’vedeveloped the clinic into a true comprehensive medical home for children withCPS involvement by providing competent and compassionate .... JP Court Liaisons advise parents to Make It Right. Published. on May 11, 2017. by.in. Newsletter. JP Court Liaisons distributed information about HCPS and its youth programs at the \"Make It Right!\" event meant to aid Harris County parents in resolving outstanding low-level warrants. \"Parents shouldn’t have to worry about being pulled over on the way to drop their children off to school or being concerned when they take their teenager to get their driver’s license,\" said JP Court Program Specialist Shenetha Toliver. \"Those should be memory-building events, free of stress,\" added Dina Johnson, also a JP Court Program Specialist.Make It Right invited Harris County residents with warrants resulting from nonviolent misdemeanor offenses that were filed in Precincts 1 and 6 to attend the event and clear those pending cases. JP Court Liaisons work with teenagers who have Class C misdemeanors, and their families. They encourage parents to take part in any Make It Right event in order to be more effective parents.Eligible charges for Make It Right include, but are not limited to, failure to appear, public intoxication, disorderly conduct and theft of less than $100. Traffic offenses and felonies are not eligible. \"This .... HAY Center Prom Event outfits foster youth. Published. on March 30, 2017. by.in. Newsletter. Five years ago, Phyllis Ocean fitted a vision-impaired teenager in a maroon dress. She and another volunteer at The HAY Center Prom Readiness Event had helped the foster youth pick out the dress, silver shoes and accessories.“She just lit up; she looked radiant,” Ocean recalled recently. “All teenagers deserve to have that special moment” of finding the perfect prom outfit.Ocean, a member of the Houston Bar Association, was one of more than 90 volunteers who helped nearly 80 foster youth prepare their night-to-remember garb on March 27.Volunteer groups also included the Houston Young Lawyers Association, Benefit Bettie and Bellaire United Methodist Church.“We extend the most heart-felt thank you to every volunteer, staff member and donor who has contributed to this event for the past six years,” said Mary Green, director of The HAY Center. “Without their generosity, this event could never happen.”The HAY Center converted its entire West Clay Street building into a mini store, complete with racks of donated dresses and suits, ties, shoes, undergarments and jewelry. Each foster youth was treated to a personal shopper to help .... HCPS retirees honored for combined 125 years of dedication. Published. on November 21, 2016. by.in. Newsletter. HCPS proudly recognized four retirees whose totaled years of dedicated service to HCPS surpassed 125 years. The four retirees were: Debra Andrews Training Institute DirectorAndrews retired with 20 years of service. In her final position as Training Institute director, she headed the department revamp and helped develop a unique prevention assessment tool.Ross Galizio CYS SupervisorGalizio retired with 27 years of service to HCPS, finishing his tenure as a vital member of the Community Youth Services (CYS) team, which helps youth and their families through in-community crisis intervention.Claudia Flores Administrative SupportFlores retired with 43 years of service to HCPS. She held several administrative positions over her tenure, the last with the HCPS Parent/Teen Survival program.Robbie Pennington Accounting SupervisorPennington retired with 39 years of service. She was instrumental in the financial organization of the Guardianship Program, which HCPS acquired in 2003.. New HCPS board members: Sheila Aron & Darryl King. Published. on November 21, 2016. by.in. Newsletter. An author and a Houston-based entrepreneur joined the HCPS board this quarter, nearly filling the seats on the 15-member board.Sheila Aron is a parenting book author who has a passion for child abuse prevention. In October, Aron donated 100 copies of her book, “I’m Glad I’m Me: Weaving the Thread of Love From Generation to Generation” to foster parents.Darryl King is co-founder and CEO of management consulting firm Principle Partnering Group, LLC. King serves on several local and statewide boards for organizations dedicated to outreach, business and youth.Commissioner Steve Radack, Precinct 3, appointed Aron. Commissioner Jack Cagle, Precinct 4, appointed King.. Youth On B.O.A.R.D. vice president active in community, career. Published. on November 21, 2016. by.in. Newsletter. The unassuming teenager, slim and soft-spoken, took the stage. Suddenly, a sweet, smooth jazz rendition of “The Children are Our Future,” filled the Houston Junior League ballroom during the “At the Heart of Families Luncheon.”Kymora Anderson, 16, is that teenager. She has been part of the HCPS Youth On B.O.A.R.D. for three years, but it is just one item on her growing pre-collegiate resume.The high school junior sings all genres. She said Youth On B.O.A.R.D. gave her the confidence to pursue and thrive in other areas of her life. She was instrumental in the youth’s anti-stigma workshop and another improving youth and adult relationships.Youth On B.O.A.R.D. encourages teenagers to have a voice. By all appearances, Anderson has found hers.. HCPS sponsors brunch recognizing foster parents. Published. on November 16, 2016. by.in. Newsletter. HCPS sponsored an October brunch for nearly 40 foster parents in Harris County. Through a close partnership, the event was hosted by the Texas Department of Family and Protective Services and sponsored by HCPS.Paul Shanklin, of Precinct 4, served as master of ceremony, enriching the programming with a song and encouragement that all should enjoy the morning.The usual December event was held in October this year to relieve some of the holiday pressure and encourage family time. HCPS also arranged for an ice cream social where 26 foster youth could mingle while their guardians enjoyed brunch.. Subscribe. Receive the latest HCPS news right in your inbox.. Email. subscribe. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/News-Events/News1/jobs-help-foster-youth-overcome-legal-challenges",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. News & Events. News. News. Featured. HCPS Executive DirectorDelivers Keynote Address. Published. on August 23, 2019. by. HCPS Content Manager.in. Featured News. ,. In the News. ,. Word from the ED. On August 16, 2019 Joel Levine, HCPS Executive Director, delivered a Keynote address to staff at the bi-annual Employee Appreciation Ceremony.  Within his remarks, Mr. Levine addressed agency accomplishments, challenges and his vision for the future.. EMPLOYEE APPRECIATION CEREMONY. August 16, 2019. KEYNOTE ADDRESS. Joel Levine. There were two young service man that enlisted in the Australian Navy. After many months at sea, they finally received a pass to spend the night in town when they docked at port. Naturally, the young men had too much to drink and were stumbling around trying to find their way back to the ship, when they bumped into a man in a decorated uniform, obviously a very .... .MNormal{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: normal;}.MNormalBold{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;}.MNormalRed{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: bold;color: #ff0000;}.MHead{font-family: Tahoma, Arial, Helvetica;font-size: 20px;font-weight: normal;color: #333333;}.MSubHead{font-family: Tahoma, Arial, Helvetica;font-size: 11px;font-weight: bold;color: #003366;}.MNormalTextBox{font-family: Tahoma, Arial, Helvetica;font-size: 12px;font-weight: normal;}. Recent News. Recent HCPS Happenings. Jobs Help Foster Youth Overcome Legal Challenges. Published. on June 9, 2017. by.in. Press Releases. Every year approximately 200 foster youth in Harris Countyage out or emancipate from the foster care system. Children who age out of careare more susceptible to negative outcomes due to a lack of traditional familysupport and opportunities. The challenges they face such as homelessness,unemployment, poverty and even incarceration can hinder a successful transitionto adulthood.. TheHAY Center. ,a program of. HarrisCounty Protective Services. , is pleased to announce that it has received a $10,000grant from the Texas Bar Foundation in support of. Overcoming Legal Challenges Faced by Current and Former Foster CareYouth to Gain Stability and Self-Sufficiency. .. The support from the Texas Bar Foundationwill allow the HAY Center to offer foster youth involved with the courts andjudicial system with paid internship opportunities to earn money to pay courtrelated costs, fees, and fines; thus avoiding additional complications.. This also allows youth to gain valuableworkforce experience, and help build skills needed for employment. Mary Green,Director of the HAY Center states:. “Weare so grateful to the Texas Bar Foundation for their support of the HAY Centerand our mission.. Giving youth theopportunity to pay off their court fees through employment will allow them tomove forward with their goals of education and employment.”. The HAYCenter provides an array of services and supports to more than 1,100 currentand former foster youth each year ages 16 through 25.. These youth and young adults are often timesnavigating the transition to adulthood with little in the way of familysupport.. Through the support of theTexas Bar Foundation the HAY Center is able to help youth earn money to becomeresponsible for their obligations under the law and become contributing membersof the community.. Since itsinception in 1965, the Texas Bar Foundation has awarded more than $17 millionin grants to law-related programs.. Supported by members of the State Bar of Texas, the Texas Bar Foundationis the nation's largest charitably-funded bar foundation.. Related Articles. Summer Jobs program kickstarts foster youth job experience. For the first time in the history of The HAY Center’s Summer Jobs Program, a youth worked in a restaurant setting this summer.. “She got to work in every position, front and back of the house, to determine if this was something she’d like to do for a career,” said Sherri Lee, Employment and Career Development Coordinator at The HAY Center.. The youth, who worked for Longhorn Steak House, was one of more than 40 who The HAY Center placed in summer positions. The program aims to build job skills in foster youth, as well as aid them in their career path.. The HAY Center. , a public/private partnership that is also a HCPS program, helps older foster youth transition to independence.. HAY Center Prom Event outfits foster youth. Five years ago, Phyllis Ocean fitted a vision-impaired teenager in a maroon dress. She and another volunteer at The HAY Center Prom Readiness Event had helped the foster youth pick out the dress, silver shoes and accessories.. “She just lit up; she looked radiant,” Ocean recalled recently. “All teenagers deserve to have that special moment” of finding the perfect prom outfit.. Ocean, a member of the Houston Bar Association, was one of more than 90 volunteers who helped nearly 80 foster youth prepare their night-to-remember garb on March 27.. Volunteer groups also included the Houston Young Lawyers Association, Benefit Bettie and Bellaire United Methodist Church.. “We extend the most heart-felt thank you to every volunteer, staff member and donor who has contributed to this event for the past six years,” said Mary Green, director of The HAY Center. “Without their generosity, this event could never happen.”. The HAY Center converted its entire West Clay Street building into a mini store, complete with racks of donated dresses and suits, ties, shoes, undergarments and jewelry. Each foster youth was treated to a personal shopper to help select a full outfit.. “It’s especially good for girls in CPS (care) to feel beautiful, because of the trauma we’ve been through,” said Carla W., 18, casually sitting in a long shimmery dress 20 minutes after her find.. As the teens ate lunch, watched movies and received lessons in tie-tying and make-up, an office full of volunteer seamstresses like Ocean altered each item to fit just right.. The alterations aren’t always easy – as a handful of seamstresses tackle dozens of hems in five hours, but Ocean said she’ll be back next year “because of the kiddies.”. The HAY (Houston Alumni & Youth) Center is a public/private partnership under the umbrella of HCPS that helps older foster youth transition to independence. The program focuses on employment and education.. To learn more about The HAY Center and how you can help, visit The HAY Center. page.and. website. .. Champion for foster youth recognized. Mary Green, director of Transitional Services at HCPS, received the June Bucy Award for Excellence from the Texas Network of Youth Services for contributions to foster youth at. The HAY Center. .. Mary has led The HAY Center since 2010. Under her direction, The HAY Center has expanded its programming for foster youth transitioning out of foster care. She was instrumental in establishing Transitional Coaching mentors, securing vouchers for affordable housing and initiating youth leadership programs.. The HAY Center is one of several HCPS programs that assists children and youth in the care of the Texas Department of Family and Protective Services. The public/private partnership is a one-stop shop to help foster youth transition to independence, with a focus on education and employment.. Youth organizing toiletry drive. HCPS clients often find themselves in need of basicsupplies, leading the HCPS Youth On B.O.A.R.D. to step in with the “EverythingBut Food” toiletry drive.. The youth, partnering with Hearts & Hands, are askingthe community to donate basic necessities – such as soap and first aid supplies– by the May 1 deadline.. Hearts & Hands partners with Houston Food Bank andlocal grocery stores to secure food items for families, “but they have a hardtime securing the non-food items that can help alleviate the financial strainon families that fall below the poverty line,” said Craig Cormier, vicepresident of Youth On B.O.A.R.D.. “I’m hoping that everyone will see this as a worthy causeand will help support families – particular the children in these families – todo things we take for granted, like having toothpaste to begin their day andsponges to wash their dishes,” Cormier said.. Donations to the “Everything But Food” toiletry drive canbe dropped off at the Youth Services Center at 6300 Chimney Rock Rd. and 2525Murworth Dr. Checks, made out to Hearts & Hands, are also accepted.. The Youth On B.O.A.R.D. is an HCPS youth leadership groupthat offers a youth voice to the HCPS Board of Directors and encouragescommunity involvement.. For moreinformation or questions about the toiletry drive, the community can call ChereaseW. Glasper at 713-295-2514.. Foster Care Center of Excellence Awarded to HCPS Clinic. HOUSTON -- In Harris County, there are over 4,000 children in the custody of the Texas Department of Family and Protective Services.. The Harris County Protective Services (HCPS) Clinic, a unique clinic dedicated to treating the trauma of children in foster care, is now the first Foster Care Center of Excellence in Harris County.. Superior Health will announce the Center of Excellence designation Tuesday at a special ceremony celebrating the collaboration between HCPS, UTHealth, the Texas Department of Family and Protective Services (DFPS) and Superior Health. To qualify as a Foster Care Center of Excellence, a clinic must meet 47 criteria and the highest standards of care for foster children and their caretakers.  The HCPS Clinic is now the only clinic in Harris County to receive the designation and the second in Texas.. “We are proud to receive this designation,” said Joel Levine, HCPS executive director. “It is a reflection of the hard work our staff has done to ensure foster children with visible and invisible wounds can heal in a safe, inviting atmosphere.”. As the oldest and first program of HCPS, the clinic was established in 1972 to provide medical services to children who have experienced trauma and are involved with Child Protective Services. It has been recognized as a one-of-a-kind clinic that brings experts together in one location to provide medical, dental and behavioral health care exclusively to children in foster care.. “Treating these children, who have been victims of abuse and neglect, by physicians using trauma-informed practices is very important for their whole-health healing,” said Dr. Kim K. Cheung, associate professor of pediatrics at UTHealth.. For more information, contact Estella Olguin at 713.410.9773.. Youth On B.O.A.R.D. vice president active in community, career. The unassuming teenager, slim and soft-spoken, took the stage. Suddenly, a sweet, smooth jazz rendition of “The Children are Our Future,” filled the Houston Junior League ballroom during the “At the Heart of Families Luncheon.”. Kymora Anderson, 16, is that teenager. She has been part of the HCPS. Youth On B.O.A.R.D..for three years, but it is just one item on her growing pre-collegiate resume.. The high school junior sings all genres. She said Youth On B.O.A.R.D. gave her the confidence to pursue and thrive in other areas of her life. She was instrumental in the youth’s anti-stigma workshop and another improving youth and adult relationships.. Youth On B.O.A.R.D. encourages teenagers to have a voice. By all appearances, Anderson has found hers.. 2795 Views. In the News. Media coverage of HCPS programs and services. Most Recent. HCPS Executive DirectorDelivers Keynote Address. August 23,2019. 0. 262. HCPS Guardianship Program Fights the Summer Heat. July 9,2018. 0. 1975. BEARing Gifts Needs Your Help to Bring Holiday Cheer.... December 1,2017. 0. 3287. Restoring Holiday Spirits with Portable AM/FM Radios. December 1,2017. 0. 2871. Healing Through the Arts: Children's Art Exhibit. November 30,2017. 0. 2890. Read More ». Media Contact. Press Releases. For media requests, contact:. Estella Olguin. Senior Communications Manager. 713.410.9773. Luis Morales. Communications Specialist. 713.394-4067. Recent News. HCPS offers new parenting class. Published. on October 19, 2017. by.in. Newsletter. Free one-day parenting classes are now available through the HCPS JP Court Liaisons program. The second round of “Teen Awareness” classes begins this fall, in addition to parenting classes offered through the TRIAD Prevention Program. The classes are open to the general public, as well as those required by court. “We wanted to offer an additional service for those individuals who are due back to court, and there are no PLL (Parenting with Love and Limits) and PTS (Parent/Teen Survival) classes available or scheduled,” said Shenetha Toliver, JP Court program specialist. Teenagers and their parents will attend two separate group sessions during the class. Parents will discuss tips regarding their child’s grades and attendance and building relationships with school officials. Students will learn about goal setting and decision-making, proper ways to show respect, social media etiquette and the dangers of running away and human trafficking. The Teen Awareness class was piloted last school year with three one-day classes. More than 150 parents and teenagers attended the classes.  “The class is one day, but the skills our participants learn are far more long-lasting,” said .... HCPS works through Harvey to serve clients, community. Published. on August 31, 2017. by.in. Newsletter. Evelyn Emdin, HCPS Kinder Emergency Shelter program manager, and the 14 youth under her watch worked together to devise a plan for additional food items on Sunday.They had been sheltered-in-place throughout Hurricane Harvey and remained optimistic.“It was so exciting and amazing to know the strength of these children,” Emdin said Tuesday.Emdin was one of several HCPS staff members who remained at the Youth Services Center throughout the record-breaking Houston disaster, and many more staff who remained committed to the community and their clients from the first day. “Judge Ed Emmett has encouraged staff to volunteer this week, while our buildings are closed. But what’s amazing about our HCPS staff is they didn’t need that encouragement,” said Joel Levine, HCPS executive director. “They were already in the community, helping the public and each other.”Community Youth Services (CYS) staff have volunteered at major shelters, such as those at the George R. Brown Convention Center and NRG Stadium, as well as those in their own communities. Kristen Ballard, a CYS program manager, said one of her staff members arranged the setup for a shelter.CYS .... HCPS Clinic prescribes back-to-school fun & health. Published. on August 1, 2017. by.in. Newsletter. John C., 14, gleefully raised his hand when his raffle number was called Saturday at the first-ever HCPS Integrated Healthcare Clinic Family Fun Day & Health Fair. He won a donated $25 gift card for ALDI.“What I’m going to do is get some stuff I really need,” John said. “What I really need are snacks! Because when I go to school, I’m going to need it.”John was one of more than 120 children who attended the fair, an effort for the HCPS Integrated Healthcare Clinic to help children and the community prepare for the coming school year.The fair included free vaccinations, school supplies, bike helmets, food, games and giveaways, many from sponsors. ALDI donated $1,000 in gift cards, the AT&T Pioneers donated school supplies, Cigna donated backpacks and Texas Children’s Hospital donated bike helmets and bike lights.Wesley Windom, of Respectful Zone Emergency Shelter, said he brought John and 15 other youth to the fair as a regular weekend outing. “This was a lot of fun for them,” Windom said. “A great way to spend a Saturday morning.” More than .... HCPS executive director highlights values in keynote speech. Published. on July 13, 2017. by.in. Newsletter. HCPS employees embodied the department’s core values during Thursday’s “Employee Appreciation Ceremony and Core Values Inauguration.”As part of the bi-annual all-staff Executive Forum,employees received awards and demonstrated the new HCPS values. More than 300 employeesparticipated in the event at the Power Center, divided between morning andafternoon sessions. Executive Director Joel Levine kicked off each session withthe keynote speech, explaining how the most recent HCPS initiative – first-evercore values – affects all other parts of HCPS and its clients. The HCPS values,released earlier this year, are: Help, Excellence, Accountability, Respect andTeamwork (H.E.A.R.T.). “They form the building blocks of our agency and helpus to define right and wrong, as well as help us determine the behaviors andperspectives that are valued within our culture,” Levine said.  “Culture is a living, breathing thing.” To showcase how important each HCPS value is to the overallmission, employees from each division then a delivered a brief presentationexhibiting each. The presentations took different forms: two as songs, one as arally and another as a teambuilding exercise. Following the presentations, employees who have reachedmilestone years with HCPS received .... Conference celebrates 'Superhero' support staff. Published. on June 13, 2017. by.in. Newsletter. The superheroesof HCPS and other Harris County offices are the administrative support staff(administrative assistants, cooks, cleaning staff, etc.), according to thespeakers and theme of the annual Dianne Bynum Administrative Support StaffConference.\"You takecare of us; you take care of the office,\" said HCPS Executive DirectorJoel Levine. \"You are our first contact (with the public) in manycases. How that client, that stakeholder, that public is treated, that tells astory about our agency -- or your agency.\"Participantspacked the conference rooms of the Harris County Department of Educationbuilding on June 2. This year's theme was: \"Supporting the Superhero inYou.\"The TrainingInstitute of HCPS has organized the conference for the past nine yearsto both train and celebrate support staff from organizationsthroughout the county. Theconference was named for Dianne Bynum, a former HCPS board president whochampioned the conferenceIn a uniquearrangement, leadership from participating organizations agree to take care ofthe office while their support staff members enjoy a full day of training --the same as any other staff member would. “It shows theircommitment and appreciation to us, by doing our work for us,” said Valencia A.Linton, who works at the front .... HCPS Clinic becomes first Center of Excellence in Harris County. Published. on May 16, 2017. by.in. Newsletter. TheHarris County Protective Services (HCPS) Integrated Healthcare Clinic, a uniqueclinic dedicated to treating the trauma of children in foster care, is now the firstFoster Care Center of Excellence in Harris County.  “Youreally are willing to go the extra mile to provide quality services to childrenwho are in foster care,” said Robert Wells, Superior Health ServicesTransformation projects manager. Wellspresented the Center of Excellence designation Tuesday at a special ceremony celebratingthe collaboration between HCPS, UTHealth, the Department of Family andProtective Services (DFPS) and Superior Health. “Weare proud to receive this designation,” said Joel Levine, HCPS executivedirector. “It is a reflection of the hard work our staff has done to ensurechildren with visible and invisible wounds can heal in a safe, invitingatmosphere.” SuperiorHealth gives the Center of Excellence title to clinics that meet a higherstandard of care for children in DFPS custody covered through the SuperiorHealth Medicaid plan. The HCPS Clinic is now the only clinic to receive thedesignation in Harris County and the second in Texas.  “We’vedeveloped the clinic into a true comprehensive medical home for children withCPS involvement by providing competent and compassionate .... JP Court Liaisons advise parents to Make It Right. Published. on May 11, 2017. by.in. Newsletter. JP Court Liaisons distributed information about HCPS and its youth programs at the \"Make It Right!\" event meant to aid Harris County parents in resolving outstanding low-level warrants. \"Parents shouldn’t have to worry about being pulled over on the way to drop their children off to school or being concerned when they take their teenager to get their driver’s license,\" said JP Court Program Specialist Shenetha Toliver. \"Those should be memory-building events, free of stress,\" added Dina Johnson, also a JP Court Program Specialist.Make It Right invited Harris County residents with warrants resulting from nonviolent misdemeanor offenses that were filed in Precincts 1 and 6 to attend the event and clear those pending cases. JP Court Liaisons work with teenagers who have Class C misdemeanors, and their families. They encourage parents to take part in any Make It Right event in order to be more effective parents.Eligible charges for Make It Right include, but are not limited to, failure to appear, public intoxication, disorderly conduct and theft of less than $100. Traffic offenses and felonies are not eligible. \"This .... HAY Center Prom Event outfits foster youth. Published. on March 30, 2017. by.in. Newsletter. Five years ago, Phyllis Ocean fitted a vision-impaired teenager in a maroon dress. She and another volunteer at The HAY Center Prom Readiness Event had helped the foster youth pick out the dress, silver shoes and accessories.“She just lit up; she looked radiant,” Ocean recalled recently. “All teenagers deserve to have that special moment” of finding the perfect prom outfit.Ocean, a member of the Houston Bar Association, was one of more than 90 volunteers who helped nearly 80 foster youth prepare their night-to-remember garb on March 27.Volunteer groups also included the Houston Young Lawyers Association, Benefit Bettie and Bellaire United Methodist Church.“We extend the most heart-felt thank you to every volunteer, staff member and donor who has contributed to this event for the past six years,” said Mary Green, director of The HAY Center. “Without their generosity, this event could never happen.”The HAY Center converted its entire West Clay Street building into a mini store, complete with racks of donated dresses and suits, ties, shoes, undergarments and jewelry. Each foster youth was treated to a personal shopper to help .... HCPS retirees honored for combined 125 years of dedication. Published. on November 21, 2016. by.in. Newsletter. HCPS proudly recognized four retirees whose totaled years of dedicated service to HCPS surpassed 125 years. The four retirees were: Debra Andrews Training Institute DirectorAndrews retired with 20 years of service. In her final position as Training Institute director, she headed the department revamp and helped develop a unique prevention assessment tool.Ross Galizio CYS SupervisorGalizio retired with 27 years of service to HCPS, finishing his tenure as a vital member of the Community Youth Services (CYS) team, which helps youth and their families through in-community crisis intervention.Claudia Flores Administrative SupportFlores retired with 43 years of service to HCPS. She held several administrative positions over her tenure, the last with the HCPS Parent/Teen Survival program.Robbie Pennington Accounting SupervisorPennington retired with 39 years of service. She was instrumental in the financial organization of the Guardianship Program, which HCPS acquired in 2003.. New HCPS board members: Sheila Aron & Darryl King. Published. on November 21, 2016. by.in. Newsletter. An author and a Houston-based entrepreneur joined the HCPS board this quarter, nearly filling the seats on the 15-member board.Sheila Aron is a parenting book author who has a passion for child abuse prevention. In October, Aron donated 100 copies of her book, “I’m Glad I’m Me: Weaving the Thread of Love From Generation to Generation” to foster parents.Darryl King is co-founder and CEO of management consulting firm Principle Partnering Group, LLC. King serves on several local and statewide boards for organizations dedicated to outreach, business and youth.Commissioner Steve Radack, Precinct 3, appointed Aron. Commissioner Jack Cagle, Precinct 4, appointed King.. Youth On B.O.A.R.D. vice president active in community, career. Published. on November 21, 2016. by.in. Newsletter. The unassuming teenager, slim and soft-spoken, took the stage. Suddenly, a sweet, smooth jazz rendition of “The Children are Our Future,” filled the Houston Junior League ballroom during the “At the Heart of Families Luncheon.”Kymora Anderson, 16, is that teenager. She has been part of the HCPS Youth On B.O.A.R.D. for three years, but it is just one item on her growing pre-collegiate resume.The high school junior sings all genres. She said Youth On B.O.A.R.D. gave her the confidence to pursue and thrive in other areas of her life. She was instrumental in the youth’s anti-stigma workshop and another improving youth and adult relationships.Youth On B.O.A.R.D. encourages teenagers to have a voice. By all appearances, Anderson has found hers.. HCPS sponsors brunch recognizing foster parents. Published. on November 16, 2016. by.in. Newsletter. HCPS sponsored an October brunch for nearly 40 foster parents in Harris County. Through a close partnership, the event was hosted by the Texas Department of Family and Protective Services and sponsored by HCPS.Paul Shanklin, of Precinct 4, served as master of ceremony, enriching the programming with a song and encouragement that all should enjoy the morning.The usual December event was held in October this year to relieve some of the holiday pressure and encourage family time. HCPS also arranged for an ice cream social where 26 foster youth could mingle while their guardians enjoyed brunch.. Subscribe. Receive the latest HCPS news right in your inbox.. Email. subscribe. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fOur-Services%2fYouth-Services%2fCYS",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/Our-Services/Youth-Services/TRIAD",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Home. Our Services. Youth Services. TRIAD. TRIAD. TRIAD Prevention Program. TRIAD is a consortium of three county agencies (HCPS, Juvenile Probation, and the Harris Center for Mental Health and IDD) working together. TRIAD provides countywide services to intervene with youth and families before involvement with the CPS, mental health and/or juvenile justice systems. There are nine programs that operate under the TRIAD program.. JP Court Liaison. JP Court Wrap. Intake Diversion. Community Youth Development (Pasadena). Youth & Family Resource Services.  (CRCG). Community Youth Development (Gulfton). TRIAD Mental Health. Parenting with Love and Limits. Parent/Teen Survival. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fHCPSLogin%2fctl%2fSendPassword",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fNews-Events%2fEvents%2fModuleID%2f15265%2fItemID%2f191330%2fmctl%2fEventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    },
    {
        "url": "http://hcps.harriscountytx.gov/HCPSLogin?returnurl=%2fNews-Events%2fEvents%2fModuleID%2f15265%2fItemID%2f191328%2fmctl%2fEventDetails",
        "text": ": Call. 713-295-2600. H. arris. C. ounty. P. rotective. S. ervices. for Children and Adults. At the Heart of Families. Donate Today. Home. About Us. Who We Are. Board Members. Board Materials. Administrative Staff. Careers. Accreditation & Partnerships. Our Services. Children's Services. Youth Services. Adult Services. News & Events. News. Events. Publications. Press Releases. Get Involved. Ways to Give. Ways to Help. HCCPS Fund. Contact Us. Locations. Frequently Asked Questions. Baby Moses Hotline. Request a Speaker. Login. Username:. Password:. Login. Cancel. Remember Login. Reset Password. 2525 Murworth, Houston, TX 77054. 713-394-4000. Copyright © 2018"
    }
]